{"account": {"verb": {"account for sth": [{"gw": "REASON", "gram": "", "is_phrase": false, "level": "C2", "definition": "to be the reason for something, or to explain the reason for something", "dic_examples": ["Can you account for your absence last Friday?", "He'd had an argument with Caroline, which accounts for his bad mood this morning.", "She was asked to account for the missing money."], "clc": "I could not account for what had happened. ()"}, {"gw": "FORM PART OF", "gram": "", "is_phrase": false, "level": "C1", "definition": "to form part of a total amount or number of something", "dic_examples": ["Senior citizens account for more than 25 percent of the state's population."], "clc": "If you look carefully at the attached pie-chart, you will easily see that the administration costs and the cost of entertainment account for a mere 15% of the total amount raised. ()"}]}}, "act": {"verb": {"act as sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to do a particular job, especially one that you do not normally do", "dic_examples": ["He was asked to act as an advisor on the project."], "clc": "In the last race held by Nostred Motor Klub, I [saw] that you were short of officials. Now I think I can act as [an] official in your club. ()"}]}}, "add": {"verb": {"add to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make a feeling or quality more extreme", "dic_examples": ["Her colleagues' laughter only added to  her embarrassment."], "clc": "To add to the bitterness, I had my right hand broken. ()"}], "add up (sth) or add (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to calculate the total of two or more numbers", "dic_examples": ["I added everything up and it comes to $45.80.", "So what do the numbers add up to?"], "clc": "NONE (NONE)"}]}}, "agree": {"verb": {"agree with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to think that something is correct or acceptable", "dic_examples": ["I don't agree with hunting."], "clc": "I don't agree with keeping animals in zoos; I think that it's cruel and unnecessary. ()"}]}}, "assign": {"verb   [T]": {"assign sb to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to give someone a particular job or place to work", "dic_examples": ["  Which police officer has been assigned to this case?"], "clc": "She was assigned to Sanming Police Station. ()"}]}}, "associate": {"verb": {"associate with sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to spend time with or have a connection with someone", "dic_examples": ["I don't want you associating with that crowd - they're always getting into trouble."], "clc": "This is a place where a lot of homeless people find shelter and even drug addicts go there to hide. So, it is clear that it is essential to protect our children from associating with all these people. ()"}]}}, "attribute": {"verb": {"attribute sth to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to say that something is caused by something else", "dic_examples": [" He attributes his success to hard work. "], "clc": "On the other hand, it might be attributed to the laziness of the people. ()"}]}}, "back": {"verb": {"back off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to move away from someone, usually because you are afraid", "dic_examples": ["I saw he had a knife and backed off immediately."], "clc": "Mad Dog would kill him if he tried to back off. ()"}], "back out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to decide not to do something you had planned or agreed to do", "dic_examples": ["Frank backed out at the last minute, so we had a spare ticket."], "clc": "I met her in the next day, and tried to make an excuse, to back out [of] the deal, but she didn't let me. ()"}], "back up sb or back sb up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to support or help someone", "dic_examples": ["My family backed me up in my fight for compensation.", "The last witness backed up what other people had said happened."], "clc": "These courses seem to have been popular, perhaps because the teacher of these courses was there to back up and help the students. ()"}], "back  up sth or back sth up": [{"gw": "", "gram": "often passive", "is_phrase": false, "level": "C2", "definition": "to prove that something is true", "dic_examples": ["His claims are backed up by recent research."], "clc": "To back up this claim, the case of children who have grown up in orphanages is often cited. ()"}], "back up (sth) or back (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make an extra copy of something that is held in your computer", "dic_examples": ["Always back up any music you download in case your computer crashes."], "clc": "NONE (NONE)"}]}}, "base": {"verb": {"base sth on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If you base something on facts or ideas, you use those facts or ideas to develop it.", "dic_examples": ["The film is based on a short story by Thomas Mann."], "clc": "This is an exciting film based on the musical \"The Phantom of the Opera\". ()"}]}}, "beat": {"verb": {"beat up sb or beat sb up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to attack someone by hitting or kicking them", "dic_examples": ["He beat up one of the other prisoners."], "clc": "He would often beat her up when he was drunk. ()"}]}}, "believe": {"verb       [T]": {"believe in sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to be certain that something exists", "dic_examples": ["Do you believe in ghosts?"], "clc": "Claire I want to tell you that we have to believe in miracles! ()"}], "believe in sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be confident that something is effective and right", "dic_examples": ["He believes in saying what he thinks."], "clc": "Nowadays I don't believe in changing your decision. ()"}]}}, "belong": {"verb     [I]": {"belong to sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "If something belongs to you, you own it.", "dic_examples": ["This book belongs to Sarah.", "You shouldn't take what doesn't belong to you."], "clc": "I need it back because it belongs to my cousin. ()"}], "belong to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to be a member of a group or organization", "dic_examples": ["We belong to the same tennis club."], "clc": "Also, I belonged to [a] golf club when I went to university in Japan. ()"}]}}, "blow": {"verb": {"blow away (sth) or blow (sth) away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If something blows away, or if the wind blows something away, that thing moves because the wind blows it.", "dic_examples": ["The letter blew away and I had to run after it.", "The wind blew the balloon away and we watched it disappear."], "clc": "NONE (NONE)"}], "blow down (sth) or blow (sth) down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If something blows down, or if the wind blows something down, that thing falls to the ground because the wind blows it.", "dic_examples": ["Two huge trees had blown down in the storm.", "The wind blew our fence down last night."], "clc": "To make matters worse, the tree that was standing near the bus stop was suddenly blown down by the wind. ()"}], "blow out (sth) or blow (sth) out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If a flame blows out, or if you blow it out, it stops burning because you or the wind have blown it.", "dic_examples": ["The candle blew out and we were left in darkness.", "She blew out the candles on her birthday cake."], "clc": "[On my birthday,] I open my presents, blow out candles, play games and more. ()"}], "blow up sth or blow sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to fill something such as a balloon or tire with air", "dic_examples": ["I spent the whole morning blowing up balloons for Joe's party.", "Can you blow the tire up for me?"], "clc": "I quickly helped others to decorate the hall - we blew up as many balloons as we c[ould] and sprayed them gold and silver. ()"}], "blow up (sth/sb) or blow (sth/sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to destroy something or kill someone with a bomb, or to be destroyed or killed by a bomb", "dic_examples": ["They threatened to blow up the plane if their demands were not met.", "He drove over a landmine and his jeep blew up."], "clc": "He said that a bomb had blow[n] up in our hotel and that a lot of people w[ere] injured. ()"}]}}, "book": {"verb   [I or T]": {"book sb in or book sb into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to arrange for someone to stay at a hotel", "dic_examples": ["She booked me into a hotel uptown."], "clc": "You all have been booked into the \"Palace Hotel\" which is one of the most comfortable [hotels] in town. ()"}]}}, "bounce": {"verb": {"bounce back": [{"gw": "SUCCESSFUL AGAIN", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start to be successful again after a difficult period", "dic_examples": ["Stock prices bounced back after a steep plunge earlier this week.", "After a terrible start the team bounced back and won the game."], "clc": "The figures reflecting the number of tonnes carried by the rail network had initially fallen in the nineteen eighties and nineteen nineties by about 40 per cent but then bounced back by the begin[n]ing of the new century. ()"}]}}, "break": {"verb": {"break down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If a machine or vehicle breaks down, it stops working.", "dic_examples": ["Our car broke down and we had to push it off the road."], "clc": "I'm just writing to tell you why I [need to] borrow your bicycle, because I am going to go [to] my farm next week and my car has broken down. ()"}], "break in or break into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to get into a building or car using force, usually to steal something", "dic_examples": ["The burglars broke in through the kitchen window.", "My car's been broken into twice this month."], "clc": "I even thought a burglar might have broken into my house and was going to kill me. ()"}], "break off (sth) or break (sth) off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to end (something) suddenly", "dic_examples": ["She broke off in the middle of a sentence.", "She broke off the engagement just two weeks before the wedding."], "clc": "As you remember, my car didn't work as well as it should and I had to break off my [trip]. ()"}], "break out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If something dangerous or unpleasant breaks out, it suddenly starts.", "dic_examples": ["War broke out in 1914.", "The fire broke out in the early morning.", "Fighting has broken out all over the city."], "clc": "Unfortunately everything was stopped because [the] Second World War broke out. ()"}], "break through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to force your way through something that is holding you back", "dic_examples": ["Protesters broke through the barriers."], "clc": "It broke through the ceiling and when she looked she saw [it was] a UFO. ()"}], "break up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If two people break up, they stop having a  relationship.", "dic_examples": ["Jenny and George have broken up.", "She's just broken up with her boyfriend."], "clc": "The problem is that a few months ago, when he had broken up with me, I wanted him to feel jealous, so I started meeting with Fredo, a friend. ()"}]}}, "bring": {"verb           [T]": {"bring back sth or bring sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to return from somewhere with something", "dic_examples": ["Can you bring me back some milk?"], "clc": "NONE (NONE)"}], "bring out sth or bring sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to produce something to sell to the public", "dic_examples": ["They've just brought out a new, smaller phone."], "clc": "Everybody knows how difficult it is to direct movies here in Greece because only [a] few movies are brought out every year. ()"}], "bring up sb or bring sb up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to care for a child until it is an adult", "dic_examples": ["She was brought up by her grandmother.", "David was brought up to respect authority."], "clc": "I'm a woman in my mid-forties and have brought up three children. ()"}], "bring up  sth or bring sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start to talk about a particular subject", "dic_examples": ["There are several points I'd like to bring up at tomorrow's meeting.", "She's always bringing up her health problems."], "clc": "This matter has always brought up some problems. ()"}]}}, "brush": {"verb": {"brush up (on) sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to improve your knowledge of something already learned but partly forgotten", "dic_examples": ["I thought I'd brush up on my French before going to Paris."], "clc": "Do you want to make new friends?  Or perhaps you want to brush up on your English? ()"}]}}, "build": {"verb   [I or T]": {"build (sth) up or build up (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to increase or develop, or to make something increase or develop", "dic_examples": ["This will help to build up his confidence.", "She exercises daily to build up her strength"], "clc": "What might take a long time to build up could be ruined in a very short time. ()"}]}}, "bump": {"verb": {"bump into sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to meet someone you know when you have not expected to meet them", "dic_examples": ["I bumped into Mark when I was out shopping this afternoon."], "clc": "This seemed like a very good decision at the beginning as now you could walk freely and could stand freely in the middle of any street to chat with [a] friend when you bumped into one. ()"}]}}, "burn": {"verb": {"burn down (sth) or burn (sth) down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to destroy something, especially a building, by fire, or to be destroyed by fire", "dic_examples": ["Their house burnt down while they were away on vacation.", "He tried to burn down the school."], "clc": "[In] about 1850, the king's castle burned down, and then he bought Amalienberg and made it a residence for the royal family. ()"}], "burn out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become ill or very tired from working too hard", "dic_examples": ["If he keeps working this hard he'll just burn out."], "clc": "I am sure that you soon will reach a stage where you will be burned out. ()"}]}}, "burst": {"verb       [I or T]": {"burst into sth": [{"gw": "ENTER SUDDENLY", "gram": "", "is_phrase": false, "level": "B2", "definition": "to enter a room or building suddenly and without warning", "dic_examples": ["The head of the department suddenly burst into the conference room."], "clc": "One of the bodyguards burst into the building, while Paul made his way out through the roof. ()"}, {"gw": "MAKE A NOISE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to suddenly start to make a noise, especially to start crying", "dic_examples": ["She put the phone down and burst into tears.", "The children  gathered on the stage suddenly burst into song."], "clc": "Ginny felt so depressed and disappointed that she burst into tears. ()"}], "burst out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to suddenly start laughing/crying/shouting, etc.", "dic_examples": ["He took one look at the hat she was wearing and burst out laughing."], "clc": "I burst out crying because my apron had burned completely. ()"}]}}, "butt": {"verb": {"butt in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to interrupt or join in a conversation or activity when the other people do not want you to", "dic_examples": ["The interviewer kept butting in and wouldn't let me answer the question."], "clc": "\"Was it a big one, Granny?\", the little girl butt[ed] in. ()"}]}}, "call": {"verb": {"call back (sb) or call (sb) back": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to telephone someone again, or to telephone someone who telephoned you earlier", "dic_examples": ["I'm kind of busy - can I call you back later?"], "clc": "If you get this note, call me back if you have a problem [on] 5681275. ()"}], "call for sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to go to a place in order to meet and travel with someone", "dic_examples": ["I'll call for you at eight."], "clc": "I'll call for you on Friday afternoon. ()"}], "call for sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to demand that something happens", "dic_examples": ["to call for a ban on guns"], "clc": "You, as the local newspaper, [are] in the proper position to call for a collective reaction against the supermarket proposal. ()"}], "call off sth or call sth off": [{"gw": "NOT HAPPEN", "gram": "", "is_phrase": false, "level": "B2", "definition": "to decide that a planned event or activity will not happen because it is not possible, useful or wanted now", "dic_examples": ["Tomorrow's match has been called off because of the icy weather."], "clc": "Take me, for example, I use it whenever there is a problem and I need some advice, or when I have to call off a meeting for any reason. ()"}, {"gw": "STOP", "gram": "", "is_phrase": false, "level": "C1", "definition": "to decide to stop an activity", "dic_examples": ["Police have called off the search."], "clc": "However, it has not been such a bad situation, and since the strike was called off two days ago everything is getting back to normal. ()"}], "call on sb to do sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to ask someone in a formal way to do something", "dic_examples": ["He called on the rebels to stop fighting."], "clc": "I saw an advertisement [i]n the local newspaper, The Leader, calling on residents in this area to help carry out a project to clean up the local environment. ()"}], "call up (sb) or call (sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to telephone someone", "dic_examples": ["Why don't you call me up at home?"], "clc": "After a few minutes, I went to a phone booth and called up my friend to apologi[z]e. ()"}], "call up sth or call sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to find and show information on a computer screen", "dic_examples": ["Can you call up last year's sales figures on Janice's computer?"], "clc": "The internet is also a great source of information and you can find almost anything you could be possibly interested in [there], starting with various kinds of music that you can freely download from the internet, [and] books you can call up on your screen straight from the online library or dictionaries, including the famous Cambridge Dictionary of English. ()"}], "be called up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to be ordered to join a military organization or asked to join a sports team", "dic_examples": ["He was called up soon after the war started.", "The team has called up several players from the minor leagues."], "clc": "The very next day her husband was called up to join the army. ()"}]}}, "calm": {"verb  [T]": {"calm down (sb) or calm (sb) down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop feeling upset, angry, or excited, or to stop someone from feeling this way", "dic_examples": ["Calm down, Lily, and tell me what's wrong.", "She was angry at first but we managed to calm her down.", "She sat down and took a few deep breaths to calm herself down."], "clc": "When I got in my car, I told myself to calm down and take a deep breath. ()"}]}}, "care": {"verb": {"care for sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to look after someone or something, especially someone who is young, old or ill", "dic_examples": ["The children are being cared for by a relative.", "She has to stay at home to care for her elderly mother."], "clc": "To care for a pet takes a lot of responsibility, money, space and, most of all, time! ()"}]}}, "carry": {"verb           [T]": {"be/get carried away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be so excited about something that you do not control what you say or do", "dic_examples": ["There's far too much food - I'm afraid I got a bit carried away!"], "clc": "I was so very tired but the book was so interesting that I got carried away. ()"}], "carry on (sth) or carry (sth) on": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to continue doing something, or to cause something to continue", "dic_examples": ["Let's carry on this discussion at some other time.", "Carry on with your work while I'm gone.", "Just carry on as if nothing happened.", "Steve just carried on talking even after the orchestra started to play."], "clc": "I promise that when I come back I'll carry on studying. ()"}], "carry out sth or carry sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to do or complete something, especially something that you have said you would do or that you have been told to do", "dic_examples": ["Nigel is carrying out research on early Christian art.", "The hospital is carrying out tests to find out what's wrong with her.", "It is hoped that the kidnappers will not carry out their threat to kill the hostages.", "Don't blame me, I'm only carrying out my orders/instructions."], "clc": "I will try to carry out my duties to the best of my ability. ()"}]}}, "catch": {"verb": {"catch on": [{"gw": "BECOME POPULAR", "gram": "", "is_phrase": false, "level": "C1", "definition": "to become popular", "dic_examples": ["I wonder if the game will catch on with young people?"], "clc": "The commercial succes[s] of \"Super agent\" has resulted in introducing \"Super agent II\", the game which is sup[p]osed to present further adventures of the agent. Unfortunately, I don't think that it will catch on. ()"}, {"gw": "UNDERSTAND", "gram": "", "is_phrase": false, "level": "C2", "definition": "to understand something, especially after a long time", "dic_examples": ["It took him a while to catch on to what we meant."], "clc": "NONE (NONE)"}], "catch up (sb) or catch (sb) up": [{"gw": "REACH SOMEONE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to reach someone in front of you by going faster than them", "dic_examples": ["I ran after her and managed to catch up with her.", "\n                             You go on ahead - I'll catch up later."], "clc": "I tried to catch up with the guide and the other tourists. ()"}, {"gw": "BE AS GOOD AS", "gram": "", "is_phrase": false, "level": "C1", "definition": "to reach the same level or quality as someone or something else", "dic_examples": ["She's doing extra work to catch up with the rest of the class."], "clc": "Her father did not really seem to hate her, after all, and if she was always left in the shadow, that happened because she did not do her best to catch up with her brothers. ()"}], "catch up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to learn and discuss the newest facts about something", "dic_examples": ["I'll call you tonight to catch up on all the gossip."], "clc": "We could catch up on each other's news. ()"}], "be/get caught up in sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become involved in a situation, often without wanting to", "dic_examples": ["How did the paper get caught up in a legal dispute?"], "clc": "In order not to get caught up in a vicious circle, it's sensible just to study well and then be able to for[e]see the results of [your] actions. ()"}], "catch up with sb": [{"gw": "MEET", "gram": "", "is_phrase": false, "level": "B1", "definition": "to meet someone you know after not seeing them for a period of time and talk about what you have been doing", "dic_examples": ["I caught up with him in Singapore a few years later.", "I'll catch up with you later!"], "clc": "You should catch up with me in Sicily, where you will be able to walk on the best beaches you have ever seen. ()"}, {"gw": "BAD THING", "gram": "", "is_phrase": false, "level": "C2", "definition": "If something bad that you have done or that has been happening to you catches up with you, it begins to cause problems for you.", "dic_examples": ["I can feel the stress of the last few weeks beginning to catch up with me."], "clc": "NONE (NONE)"}], "catch up on/with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to do something that you did not have time to do earlier", "dic_examples": ["I'm hoping to catch up on some sleep."], "clc": "It gave me time to catch up with my reading and sleeping. ()"}]}}, "cater": {"verb   [I or T]": {"cater to sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to provide what is wanted or needed by a particular group of people", "dic_examples": ["Our magazines cater to professionals such as lawyers and physicians.", " This legislation simply caters to a small minority and shouldn't be passed."], "clc": "Retail establishments have enhanced and multiplied [their] product offerings to cater to a wider market. ()"}]}}, "chat": {"verb    [I]": {"chat sb up or chat up sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to talk to someone in a way that shows them that you are sexually attracted to them", "dic_examples": ["He spends hours in cafés, chatting up the waitresses."], "clc": "Then he started to chat her up. ()"}]}}, "cheat": {"verb   [I or T]": {"cheat on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to have a secret sexual relationship with someone who is not your usual sexual partner", "dic_examples": ["She found out that Jeremy had been cheating on her."], "clc": "In Cancun, I met another cute guy and I cheated on my boyfriend with him but that was just an affair, that did not mean anything to me. ()"}]}}, "check": {"verb": {"check in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to go to the counter at an airport, so that you can be told where you will be sitting and so that your bags can be put on the aircraft", "dic_examples": ["Passengers must check in two hours before the flight."], "clc": "I had to check in at 2:15 pm. ()"}], "check in/check into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to say who you are when you arrive at a hotel so that you can be given a key for your room", "dic_examples": ["Check in at the reception desk when you arrive."], "clc": "We checked in at the hotel and we all went to bed early that night. ()"}], "check (up) on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to try to discover how something is progressing or whether someone is doing what they should be doing", "dic_examples": ["My boss is always checking up on me."], "clc": "NONE (NONE)"}], "check out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to leave a hotel after paying and returning your room key", "dic_examples": ["We checked out of our hotel at 5 a.m. to catch a 7\n                             a.m. flight."], "clc": "[On] the last day we decided to stay in the hotel because we had to check out at noon. ()"}], "check sth out or check out sth": [{"gw": "INFORMATION", "gram": "", "is_phrase": false, "level": "C1", "definition": "to examine something or get more information about it in order to be certain that it is true, safe, or suitable", "dic_examples": ["We'll need to check out his story."], "clc": "Go and check it out: 1st Avenue, Ipanema. \"PIANTELLA RESTAURANT.\" It is one of the most sop[h]isticated restaurants in Rio. ()"}, {"gw": "GO TO SEE", "gram": "", "is_phrase": false, "level": "C1", "definition": "to go to a place in order to see what it is like", "dic_examples": ["Let's check out that new dance club."], "clc": "NONE (NONE)"}]}}, "cheer": {"verb    [I]": {"cheer sb on or cheer on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to shout loudly in order to encourage someone in a competition", "dic_examples": ["The race was tough, but I could hear all my friends cheering me on."], "clc": "People rush to the stadiums and gyms to cheer on their favorites or spend long hours in front of the TV with their fingers crossed hoping for a win. ()"}], "cheer up (sb) or cheer (sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If someone cheers up, or something cheers them up, they start to feel happier.", "dic_examples": ["She was very sick so I sent her some flowers to cheer her up.", "Cheer up! It's not that bad!", "She went shopping to cheer herself up."], "clc": "My sister tried to cheer me up but she couldn't. ()"}]}}, "chill": {"verb  [I or T]": {"chill out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to relax completely, or not allow things to upset you", "dic_examples": ["Chill out, Dad - if we miss this train there's always another one."], "clc": "I just can't wait to get there, grab some Coke and chill out! ()"}]}}, "chip": {"verb": {"chip in (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If several people chip in, they each give money to pay for something together.", "dic_examples": ["We all chipped in to buy our teacher a present."], "clc": "If you say it's on you they will offer to chip in and you can always say politely: \"Sure, why not.\" ()"}]}}, "chop": {"verb   [T]": {"chop sth down or chop down sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to cut through something to make it fall down", "dic_examples": ["We chopped down the old apple tree."], "clc": "We send people to chop down trees and to ext[rac]t materials such as metals so that we can demonstrate our expensive possessions. ()"}]}}, "clean": {"verb     [T]": {"clean sth out or clean out sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to take everything out of a room, car, container, etc. and clean the inside of it", "dic_examples": ["I cleaned out the fridge this morning."], "clc": "The owner, an almost illiterate woman, claimed to have come across the diary as she was cleaning out the attic. ()"}], "clean up (sth) or clean (sth) up": [{"gw": "MAKE CLEAN", "gram": "", "is_phrase": false, "level": "C1", "definition": "to make something clean and neat", "dic_examples": ["You need  to clean up your room.", "We'll clean this mess up before we leave.", "I have to clean up before the guests arrive."], "clc": "I usually clean up my room once a week myself, and [the] cleaner does it on every Tuesday. ()"}, {"gw": "REMOVE POLLUTION", "gram": "", "is_phrase": false, "level": "C1", "definition": "to remove pollution from somewhere", "dic_examples": ["They are developing processes to clean up polluted rivers."], "clc": "I can also help by distributing leaflets which contain information on how to start cleaning up the environment. ()"}]}}, "clear": {"verb      [T]": {"clear sth away or clear away sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to make a place neat by removing things from it, or putting them where they should be", "dic_examples": ["We need to clear away  these tree branches that were knocked down in the storm"], "clc": "After clearing away the worst mess, she opened the left drawer, and there it was! ()"}], "clear up sth or clear sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to give an explanation for something, or to deal with a problem or argument", "dic_examples": ["Before we sign the contract, there are a few points we should clear up."], "clc": "I hope this will clear up your problem. ()"}], "clear up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If the weather clears up, it improves and becomes sunny.", "dic_examples": ["I hope the weather clears up before this afternoon."], "clc": "For the first two days the weather was so bad that we couldn't reach the beach but finally the sky cleared up. ()"}]}}, "cling": {"verb   [I]": {"cling to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to try very hard to keep something", "dic_examples": [" He clung to power for ten more years. "], "clc": "Thankfully, there are those who still cling to such age-old values as personal contentment and growth regarding them as the anchors which hold happiness fast. ()"}]}}, "close": {"verb": {"close down (sth) or close (sth) down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a business or organization closes down or someone closes it down, it stops operating.", "dic_examples": ["All the mines in this area were closed down in the 80s.", "Our local butcher is closing down."], "clc": "I must tell you that unfortunately \"Hotel Astrid\" closed down last year. ()"}], "close in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to  gradually get nearer to someone, usually in order to attack them or stop them from escaping", "dic_examples": ["Police closed in on the demonstrators."], "clc": "With the [high]way so close by and all the industrial areas closing in on us, where are we to go? ()"}], "close off sth or close sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to put something across the entrance to a place in order to keep people from entering it", "dic_examples": ["Police quickly closed off the area."], "clc": "And while it is being buil[t], it will temporar[il]y cause even more problems for traffic, as some streets will be closed off. ()"}]}}, "come": {"verb                                                                              [I]": {"come about": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to happen or start to happen", "dic_examples": ["How did the idea for an arts festival come about?"], "clc": "Speaking of the past and its importance in our present, one cannot fail to observe that the very cumulative experience of a nation erects the foundation for our future.  How does that come about? ()"}], "come across": [{"gw": "SEEM", "gram": "", "is_phrase": false, "level": "C1", "definition": "to seem to be a particular type of person or thing", "dic_examples": ["He came across as shy.", "Her confident manner can sometimes come across as arrogance.", "All these promises just come across as a meaningless political stunt."], "clc": "Tom comes across as a lively as well as a reliable person. ()"}, {"gw": "CLEAR", "gram": "", "is_phrase": false, "level": "C2", "definition": "If an idea or emotion comes across, it is expressed clearly and people understand it.", "dic_examples": ["His bitterness comes across in his poetry."], "clc": "NONE (NONE)"}], "come across sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to meet someone or find something by chance", "dic_examples": ["He came across some of his old love letters in his wife's drawer."], "clc": "Luckily, I've come across an advertisement of a well-known computer trader. ()"}], "come along": [{"gw": "GO WITH SOMEONE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to go somewhere with someone", "dic_examples": ["We're going to the movies. Do you want to come along?"], "clc": "I'm really expecting you guys to come along. ()"}, {"gw": "ARRIVE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to arrive or appear at a place", "dic_examples": ["A taxi never comes along when you need one."], "clc": "I did not know what to do with it, and that moment my friend John came along. I told him what I had done and he told me that I could trust him with the ticket and that there was no need for me to take it home. ()"}, {"gw": "EXIST", "gram": "", "is_phrase": false, "level": "C2", "definition": "to start to exist", "dic_examples": ["I gave up mountain climbing when my first child came along."], "clc": "A few years went past before the second child came along, by this time the family had just moved into a new house, so the mother decided to be a h[ouse]wife and a kind of \"day-mother\" for the neighbors' children. ()"}], "come around": [{"gw": "AGREE", "gram": "", "is_phrase": false, "level": "C2", "definition": "to change your opinion about something, or agree to an idea or a plan that you were against", "dic_examples": ["I know Maria doesn't like you borrowing her car but she'll soon come around."], "clc": "Fortunately, my parents finally came [a]round to my way of thinking and I am glad to say they are most supportive. ()"}, {"gw": "BECOME CONSCIOUS", "gram": "", "is_phrase": false, "level": "C1", "definition": "to become conscious again after an accident or medical operation", "dic_examples": ["When he came around, he couldn't remember what had happened."], "clc": "When he came [a]round, he was lying in a bed, surrounded by smiling women. ()"}], "come back": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to return to a place", "dic_examples": ["I'll come back and pick you up in half an hour.", "We've just come back from Mexico."], "clc": "I['ll be] wait[ing] for your call, when you come back. ()"}], "come between sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to harm the relationship between two or more people", "dic_examples": ["I won't let anything come between me and my children."], "clc": "Of course, there was the problem of religion that came between us. ()"}], "come by sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to get something, especially something that is unusual or difficult to find", "dic_examples": ["Cheap organic food is still difficult to come by."], "clc": "In the world we live in today, jobs have become much more difficult to come by. ()"}], "come down": [{"gw": "FALL", "gram": "", "is_phrase": false, "level": "B2", "definition": "to drop to the ground or floor", "dic_examples": ["A lot of trees came down in the storm.", "Our plane came down in a field.", "We watched the building come down in a controlled explosion."], "clc": "Luckily, the curtain came down and the play was postponed. ()"}, {"gw": "LOWER LEVEL", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a price or a level comes down, it becomes lower.", "dic_examples": ["House prices have come down recently.", "Inflation is coming down."], "clc": "The GDP (Gross Domestic Product) has come down from 0.3% to 0.2%. ()"}], "come down to sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If a situation, problem, decision, etc. comes down to something, then that is the thing that will influence it most.", "dic_examples": ["The success of the venture comes down to the commitment of those involved."], "clc": "In the end, it all comes down to the question of job satisfaction. ()"}], "come down with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become ill", "dic_examples": ["I feel like I'm coming down with a cold."], "clc": "I must apologize for writing so late, but my sister came down with [the] flu and I had to visit her. ()"}], "come from swh/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "A1", "definition": "to be born, gotten from, or made in a particular place", "dic_examples": ["She comes from Italy.", "Where do you come from?", "Some of the best wines come from France.", "Does that quote come from Shakespeare?", "She could hear banging coming from the room upstairs.", "Where will the money for the project come from?"], "clc": "My friend's name is Niloo. She comes from Iran. ()"}], "come in": [{"gw": "ENTER", "gram": "", "is_phrase": false, "level": "A2", "definition": "to enter a room or building", "dic_examples": ["Do you want to come in for a cup of tea?", "Hi, come in - nice to see you!"], "clc": "He asked me if he could come in, and I said yes. ()"}, {"gw": "BE INVOLVED", "gram": "", "is_phrase": false, "level": "C2", "definition": "used to describe how someone is involved in a situation, story, or plan", "dic_examples": ["We need people to help clean up, and that's where you come in."], "clc": "Another measure is to encourage people to do some forms of exercise and this is where health care practitioners come in. ()"}], "come in for sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If someone comes in for criticism, praise, etc., they are criticized, praised, etc.", "dic_examples": ["He came in for a lot of criticism for his remarks."], "clc": "The most important part of this process, and one of extremely great importance for the exhibition, is that he had to endure prejudice and often came in for heavy criticism. ()"}], "come into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to get money from someone who has died", "dic_examples": ["Just after I finished college, I came into a little money."], "clc": "Even though one might jump to the conclusion that he probably came into a fortune when his father passed away after setting up a successful business, this is not the case. ()"}], "come off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to happen successfully", "dic_examples": ["His attempt to impress us all didn't quite come off."], "clc": "There were some points in the schedule which frankly speaking didn't come off and the organization failed [in] some points as well. ()"}], "come on": [{"gw": "START", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start to happen or work", "dic_examples": ["The heat comes on at six in the morning.", "I feel like I've got a cold coming on."], "clc": "You can now also do you[r] shopping on the internet, get in contact with your bank and talk to doctors if you feel an illness coming on. ()"}, {"phrase": "Come on!", "is_phrase": true, "level": "B1", "definition": "said to encourage someone to do something, especially to hurry or try harder", "dic_examples": ["Come on or we'll be late!"], "clc": "Come on, help me to find it. ()"}], "come out": [{"gw": "BECOME AVAILABLE", "gram": "", "is_phrase": false, "level": "B1", "definition": "If a book, record, movie, etc. comes out, it becomes available for people to buy or see.", "dic_examples": ["When does their new album come out?"], "clc": "We're going to se[e] \"Blade\". It came out just yesterday. ()"}, {"gw": "SUN", "gram": "", "is_phrase": false, "level": "B1", "definition": "When the sun, the moon, or a star comes out, it appears in the sky.", "dic_examples": ["It's really warm when the sun comes out."], "clc": "When we were coming back, the sun came out. ()"}, {"gw": "BE REMOVED", "gram": "", "is_phrase": false, "level": "C2", "definition": "If dirt or a mark comes out of something, it disappears when you clean it.", "dic_examples": ["Will this red wine stain come out?"], "clc": "At the same time the sparkling, living and red-as-hell blood stain came out. ()"}, {"gw": "INFORMATION", "gram": "", "is_phrase": false, "level": "B2", "definition": "If results or information come out, they are given to people.", "dic_examples": ["Information about class placement will come out in August."], "clc": "The results finally came out at the beginning of October. ()"}, {"gw": "TELL", "gram": "", "is_phrase": false, "level": "C2", "definition": "to tell people that you are homosexual", "dic_examples": ["He hasn't come out to his family."], "clc": "NONE (NONE)"}, {"gw": "BE SAID", "gram": "", "is_phrase": false, "level": "C2", "definition": "If something that you say comes out in a particular way, you say it in that way.", "dic_examples": ["I wanted to tell her that I loved her, but it came out all wrong."], "clc": "NONE (NONE)"}, {"gw": "BECOME KNOWN", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become known", "dic_examples": ["The truth about him will come out in the end."], "clc": "Murder thrillers are supposed to keep the reader in suspense right up to the last page when the truth unexpectedly comes out. ()"}], "come out of sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If something comes out of a process or event, it is one of the results.", "dic_examples": ["I hope something good can come out of this mess."], "clc": "So I ended up with something practically unnecessary to me.  But something positive came out of it. ()"}], "come over": [{"gw": "MOVE TOWARD", "gram": "", "is_phrase": false, "level": "C1", "definition": "to come to a place, move from one place to another, or move towards someone", "dic_examples": ["Come over here and I'll do your hair for you.", "Are your family coming over from Greece for the wedding?"], "clc": "I recently moved to a new house, because my wife came over from Sri Lanka. ()"}, {"gw": "SEEM", "gram": "", "is_phrase": false, "level": "C2", "definition": "to seem to be a particular type of person", "dic_examples": ["Henry came over as a real enthusiast."], "clc": "He always comes over as very honest, and even though he is ambitious the way he promotes himself is much more subtle than usually seen. ()"}], "come over sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "If a feeling comes over you, you suddenly experience it.", "dic_examples": ["I don't usually get so angry. I don't know what came over me."], "clc": "It is sometimes enough just to see a photograph of yourself shot 3 years ago and it comes to your mind, \"What on earth came over me?!\" ()"}], "come through": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If information, a result, or a document comes through, you receive it.", "dic_examples": ["Have the results of the tests come through yet?"], "clc": "If the divorce had come through, they would have spent whole weekends together. ()"}], "come through (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to manage to get to the end of a difficult or dangerous situation", "dic_examples": ["We've had some hard times, but we've come through them."], "clc": "Those who have managed to come through all these hard years and got the desired medals expect now to be paid back. ()"}], "come to sth": [{"gw": "TOTAL", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be a particular total when numbers or amounts are added together", "dic_examples": ["That comes to $50, please."], "clc": "[If] a bill c[ame] to $1000, you would be shocked and regret what you had done. ()"}, {"gw": "DIFFERENT STATE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to reach a state, or change to a different state", "dic_examples": ["I was sad when the evening came to an end.", "I came to the conclusion that the relationship wasn't working.", "That was when this administration came to power."], "clc": "That's why I came to the conclusion that the motorb[i]ke, together with anti-smog equipment, is the [only way] to get to work, unless you want [to] spend hours in a traffic jam. ()"}], "come under sth": [{"gw": "LIST", "gram": "", "is_phrase": false, "level": "C1", "definition": "to be in a particular part of a book, list, etc.", "dic_examples": ["Hairdressers come under \"beauty salons\" in the Yellow Pages."], "clc": "Qui[te] a few, it seems, opted to go for places where they had previously worked. 17% from Education, 5% from Arts and [S]cience and 3% from the Science Stream, come under this category. ()"}, {"gw": "EXPERIENCE", "gram": "", "is_phrase": false, "level": "C1", "definition": "to experience something, often something unpleasant", "dic_examples": ["We came under a lot of pressure to leave the area.", "They have come under criticism from local campaigners."], "clc": "This opinion is true in a sense but it also depends on how kids are brought up and what influences they came under. ()"}], "come up": [{"gw": "MOVE TOWARD", "gram": "", "is_phrase": false, "level": "B2", "definition": "to move toward someone", "dic_examples": ["A young girl came up to me and asked for money."], "clc": "A tall slim Soc came up and said:- \"I will, Daryl old bud.\" It was James, Daryl's old school friend. ()"}, {"gw": "BE MENTIONED", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be mentioned or talked about in conversation", "dic_examples": ["What points came up at the meeting?"], "clc": "From time to time the discussion about keeping animals in zoos comes up. ()"}, {"gw": "SUN/MOON", "gram": "", "is_phrase": false, "level": "B2", "definition": "When the sun or moon comes up, it rises.", "dic_examples": ["We watched the sun come up over the ocean."], "clc": "NONE (NONE)"}, {"gw": "OPPORTUNITY", "gram": "", "is_phrase": false, "level": "C1", "definition": "If a job or opportunity comes up, it becomes available.", "dic_examples": ["If some work comes up, you should take it."], "clc": "I am delighted to help and advise you about the three proposals that have just come up. ()"}, {"phrase": "be coming up", "is_phrase": true, "level": "B2", "definition": "to be happening soon", "dic_examples": ["Final exams are coming up next month."], "clc": "A holiday is coming up next month so it would be great if you could come sometime between Wednesday 27th to Saturday 30th. ()"}, {"gw": "PROBLEM", "gram": "", "is_phrase": false, "level": "C1", "definition": "If a problem or difficult situation comes up, it happens.", "dic_examples": ["Sorry I'm late - a problem came up with my schedule."], "clc": "I found it very useful that I did not have to write or read, and if a problem came up I just called the qualified teacher. ()"}, {"gw": "COMPUTER", "gram": "", "is_phrase": false, "level": "C1", "definition": "If information comes up on a computer screen, it appears there.", "dic_examples": ["The images came up on the screen."], "clc": "The photo instantly comes up on the screen of the computer and you can enjoy the game with the photo. ()"}], "come up against sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to have to deal with a problem or difficulty", "dic_examples": ["She came up against a lot of sexism in her first engineering job."], "clc": "It is essential to get along well with your partners, otherwise you may come up against many problems, such as a loss of motivation, or even the risk of being fired. ()"}], "come up with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to suggest or think of an idea or plan", "dic_examples": ["She's come up with some amazing scheme to double her income."], "clc": "Together with my teacher we came up with the idea of asking you to come to the college in order to give a talk about your latest book and about the experiences you have had as a novelist. ()"}]}}, "complain": {"verb   [I]": {"complain of sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to tell other people that something is making you feel ill", "dic_examples": ["She's been complaining of a headache all day."], "clc": "I asked her if he [had] complained of any pains or aches? ()"}]}}, "consist": {"verb": {"consist of sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to be made of or formed from something", "dic_examples": ["The team consists of four Europeans and two Americans.", "It's a simple dish to prepare, consisting mainly of rice and vegetables."], "clc": "Our team consists of 15 girls, who are all between 16 and 18. ()"}]}}, "cool": {"verb    [I or T]": {"cool down/off (sb/sth) or cool (sb/sth) down/off": [{"gw": "BECOME LESS HOT", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become less hot, or to make someone or something become less hot", "dic_examples": ["She waited until her coffee had cooled down and then took a sip.", "We went for a swim to cool off."], "clc": "The pool is a very popular place to cool down [in]. ()"}, {"gw": "BECOME CALMER", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become calmer, or to make someone become calmer", "dic_examples": ["Just leave her to cool off and then talk to her."], "clc": "It seemed to me that you were stressed.  If I were you, I would cool down a little. ()"}]}}, "count": {"verb": {"count sb in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to include someone in an activity", "dic_examples": ["If you're going for a pizza, you can count me in."], "clc": "I can always count her in. She is always there by my side. ()"}], "count on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to have confidence in someone because you know they will do what you want", "dic_examples": ["I can always count on my parents to help me."], "clc": "So Jan, I'm sure I can count on you. ()"}], "count on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to expect something to happen and make plans based on it", "dic_examples": ["I didn't count on so many people coming to the party."], "clc": "This town can always count on the same quality and variety of films as any other city in the world. ()"}], "count toward sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to be part of what is needed to complete something or achieve something", "dic_examples": ["This essay counts toward my final grade."], "clc": "NONE (NONE)"}], "count up sb/sth or count sb/sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to add together all the people or things in a group", "dic_examples": ["If you count up all the money in your various savings accounts, it is quite a large sum."], "clc": "People might not consider food to be of great importance, but it surely is, especially counting up all the hours we spend in kitchens or in supermarkets (looking for food, thinking of what we might fancy having for dinner). ()"}]}}, "cover": {"verb           [T]": {"cover sth up or cover up sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to put something over something else, in order to protect or hide it", "dic_examples": ["We used a picture to cover up a hole in the wall."], "clc": "I've seen numerous black and white photographs of my grandparents in traditional Japanese kimonos, covering up their body parts as much as possible. ()"}], "cover (sth) up or cover up (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to stop people from discovering the truth about something bad", "dic_examples": ["She tried to cover up her mistakes."], "clc": "Realizing too late that it was the wrong piece of music he was playing, he tried to cover it up, so the audience would not know he had made a mistake. ()"}]}}, "crack": {"verb      [I or T]": {"crack down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to start dealing with bad or illegal behavior in a more severe way", "dic_examples": ["Police are cracking down on crime in the area."], "clc": "Introducing a totally new policy, dismissing the members of the parliament and cracking down on the leftist underworld, he proved to be a person really dedicated [to] the country. ()"}], "crack up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become mentally ill", "dic_examples": ["We're worried he'll crack up completely if he doesn't get help."], "clc": "Nevertheless, one must also bear in mind the fact that, since Douglas was overworked, Olivia had a tedious, boring life and was about to crack up, when the Nawab came to res[c]ue her. ()"}], "crack (sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to laugh a lot or to make someone laugh a lot", "dic_examples": ["His impressions of my Dad really crack me up."], "clc": "One film that I found hilariously funny was \"Meet the Parents.\" Directed by Frank Oz, this film has all the qualifications to make someone crack up. ()"}]}}, "cry": {"verb": {"be crying out for sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to need something very much", "dic_examples": ["a school that's crying out for more money"], "clc": "She had the unhappiest look I've ever seen and one could see through her brown, almond-shaped eyes that she was crying out for affection and love. ()"}], "cry out (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to shout or make a loud noise because you are frightened, hurt, etc.", "dic_examples": ["She cried out in pain as she fell."], "clc": "The guide ended this bit of information and led the people out of the corridor when one young child cried out in terror. ()"}]}}, "cut": {"verb": {"cut across sth": [{"gw": "DIRECTION", "gram": "", "is_phrase": false, "level": "B2", "definition": "to go from one side of an area to the other, instead of going around it", "dic_examples": ["If we cut across this field, it will save time."], "clc": "I wanted to cut across the garden of the house, and climbed over the fence. ()"}, {"gw": "GROUP", "gram": "", "is_phrase": false, "level": "C1", "definition": "If a problem or subject cuts across different groups of people, all of those groups are affected by it or interested in it.", "dic_examples": ["Interest in the Internet cuts across all age groups."], "clc": "The TV has a wide audience cutting across all the sections of the society. ()"}], "cut back (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to reduce the amount of money being spent on something", "dic_examples": ["We have had to cut back on training this year."], "clc": "There are ways to cut back on spending. ()"}], "cut down sth or cut sth down": [{"gw": "REMOVE", "gram": "", "is_phrase": false, "level": "B2", "definition": "If you cut down a tree or bush, you make it fall to the ground by cutting it near the bottom.", "dic_examples": ["The new owners cut down the apple trees."], "clc": "People cut down the tropical rainforest to get the wood and [make] room for agriculture. ()"}, {"gw": "REDUCE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to reduce the amount, number, length or size of something", "dic_examples": ["They've cut her hours down at work."], "clc": "You'll see that this will help you to cut down your overtime in the long run. ()"}, {"gw": "DIET", "gram": "", "is_phrase": false, "level": "B2", "definition": "to eat or drink less of a particular thing, usually in order to improve your health", "dic_examples": ["I'm trying to cut down on the amount of sugar I eat."], "clc": "Secondly you must quit smoking and you must cut down on coffee. ()"}], "cut off sb/sth or cut  sb/sth off": [{"gw": "STOP PROVIDING", "gram": "often passive", "is_phrase": false, "level": "B2", "definition": "to stop providing something such as electricity or water", "dic_examples": ["If we don't pay the gas bill, we'll be cut off."], "clc": "That's when the electricity was cut off. ()"}, {"gw": "BE TRAPPED", "gram": "often passive", "is_phrase": false, "level": "B2", "definition": "to prevent people from reaching or leaving a place, or to separate them from other people", "dic_examples": ["The whole village was cut off by flooding."], "clc": "We were isolated [from] the other nearby villages because the snow cut off the only [road to] our village. ()"}], "cut out sth or cut sth out": [{"gw": "SHAPE", "gram": "", "is_phrase": false, "level": "C1", "definition": "to remove something or form a shape by cutting, usually something made of paper or cloth", "dic_examples": ["She cut out his picture from the magazine."], "clc": "To make it cheaper, cut the coupons out of the papers, don't go shopping when you're hungry and try to stick to your budget. ()"}, {"gw": "STOP EATING", "gram": "", "is_phrase": false, "level": "C1", "definition": "to stop eating or drinking something, usually to improve your health", "dic_examples": ["I've cut out red meat from my diet."], "clc": "I think they should also try to cut out cigarettes and take some exercise besides changing [their] eating habits. ()"}, {"phrase": "not be cut out to be <i>sth</i>/not be cut out for <i>sth</i>", "is_phrase": true, "level": "C2", "definition": "to not have the right qualities for something", "dic_examples": ["I'm not really cut out to be a nurse."], "clc": "I still think her behavior was absolutely beastly, because students will always make mistakes but it is vital not to reprimand them too harshly otherwise they will lose all their confidence and become convinced that they are not cut out for school. ()"}], "cut up sth or cut  sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to cut something into pieces", "dic_examples": ["Could you cut up the cake and put it on plates?"], "clc": "I cut up the cake. ()"}]}}, "date": {"verb": {"date back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to have existed a particular length of time or since a particular time", "dic_examples": ["This house dates back to 1650."], "clc": "Near the end of the route there's a castle that dates back to the Middle Ages, which would be really nice to visit. ()"}], "date from sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to have existed since a particular time", "dic_examples": ["The castle dates from the 11th century."], "clc": "The Olympic Museum dates from the 19th century and is the biggest in Europe. ()"}]}}, "dawn": {"verb": {"dawn on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If a fact dawns on you, you become aware of it after a period of not being aware of it.", "dic_examples": ["It finally dawned on him that she’d been joking."], "clc": "It dawned on him that for whatever the reason he was now alone in the city. ()"}]}}, "deal": {"verb": {"deal with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to take action in order to achieve something or in order to solve a problem", "dic_examples": ["How do you intend to deal with this problem?", "The building manager dealt with the heating problem."], "clc": "Sorry about such [a] late reply, but I've had some problems to deal with. ()"}], "deal with sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to talk to someone or meet someone, especially as part of your job", "dic_examples": ["She's used to dealing with difficult customers."], "clc": "In my previous job,  I used to deal with many, many people. ()"}]}}, "depend": {"verb": {"depend on/upon sb/sth": [{"gw": "BE INFLUENCED BY", "gram": "", "is_phrase": false, "level": "B1", "definition": "If something depends on someone or something, it is influenced by them, or changes because of them.", "dic_examples": ["Which phone you can buy depends on how much you're willing to spend.", "I'm not sure if we'll go to the beach - it depends on the weather."], "clc": "But, [o]n the other hand, you should explain to your parents what you want to do because you know that your decision depends on what they say. ()"}, {"gw": "NEED", "gram": "", "is_phrase": false, "level": "B2", "definition": "to need the help and support of someone or something in order to exist or continue as before", "dic_examples": ["She depends on her son for everything.", "The country depends heavily on foreign aid."], "clc": "I don't want to depend on my parents any more. ()"}, {"gw": "RELY", "gram": "", "is_phrase": false, "level": "B2", "definition": "to trust someone or something and know that they will help you or do what you want or expect them to do", "dic_examples": ["You can always depend on Michael in a crisis.", "I'm depending on you to keep your promise.", "You can't depend on the train being on time."], "clc": "I hope you'll let me join your foundation because I could be a member you can depend on. ()"}]}}, "derive": {"verb": {"derive (sth) from sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to come from or be developed from something", "dic_examples": [" Many English words derive from Latin."], "clc": "From another chart, we can have a clear understanding of nuclear power's contribution to different European countries: 78.0% [of] electricity production derived from nuclear power in France, and 60.1% of that in Belgium. ()"}]}}, "descend": {"verb   [I or T]": {"descend from sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to be related to a person or group of people who lived in the past", "dic_examples": ["Her father is descended from Greek royalty."], "clc": "It is to say that the proprietor descends from an important family of cooks and that he knows all the secrets of ancient home-made dishes. ()"}]}}, "devote": {"verb": {"devote sth to sb/sth": [{"gw": "USE TIME", "gram": "", "is_phrase": false, "level": "B2", "definition": "to use time, energy, etc. for a particular purpose", "dic_examples": ["He resigned from his job to devote more time to his family."], "clc": "At that time, everyone should have devoted their life to the nation. ()"}, {"gw": "USE SPACE", "gram": "often passive", "is_phrase": false, "level": "B2", "definition": "to use a space or area for a particular purpose", "dic_examples": ["Most of the magazine was devoted to celebrity gossip."], "clc": "This report was devoted to the Westfield Music Festival. ()"}], "devote yourself to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to spend all your time or energy doing something that you think is important", "dic_examples": ["He retired in 1814 to devote himself to social reforms."], "clc": "The current situations or problems in the world will stimulate young people to devote themselves to some community/charity work or contribute to national affairs. ()"}]}}, "die": {"verb     [I]": {"die down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If something, especially noise or excitement, dies down, it gradually becomes less loud or strong until it stops.", "dic_examples": ["She waited for the laughter to die down before she spoke."], "clc": "Even the best materials wouldn't be able to avoid the deafening noise which does not ever die down. ()"}], "die out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become more and more rare and then disappear completely", "dic_examples": ["Dinosaurs died out about 65 million years ago."], "clc": "A second point is that [a] lot of animals are going to die out because of pollution. ()"}]}}, "dispose": {"verb": {"dispose of sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to get rid of something, especially by throwing it away", "dic_examples": ["I need to dispose of these old clothes."], "clc": "I would like to suggest topics on effective waste management or on how we should properly dispose of our garbage. ()"}]}}, "dive": {"verb    [I]": {"dive into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to start doing something suddenly and energetically, often without stopping to think", "dic_examples": ["Unfortunately, I dove into the discussion without being fully informed."], "clc": "Firstly, it is possible for me to dive into a whole new world - personally, socially and professionally - without losing myself. ()"}]}}, "do": {"verb": {"do up sth or do sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to repair or decorate a building so that it looks attractive", "dic_examples": ["He does up old houses and then sells them."], "clc": "I think we could do up some of our old buildings that are nice but [which] the d[ir]t and the pollution  don't let us see. ()"}], "do without (sb/sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to manage without having something", "dic_examples": ["Andrew's our best player - we can't really do without him."], "clc": "We can't stand doing without the car. ()"}], "do away with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to get rid of something or stop using something", "dic_examples": ["We may do away with the school uniform soon.", "These ridiculous rules and regulations should have been done away with years ago."], "clc": "Argentinians seem to be doing away with fried food and baking, boiling and steaming are now the most common ways of cooking. ()"}]}}, "dole": {"verb": {"dole sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to give something, especially money, to several people or in large amounts", "dic_examples": ["I've had to dole out nearly $500 this month."], "clc": "But still, doling out money does not make the people that receive it happy. ()"}]}}, "draw": {"verb": {"draw on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to use information or your knowledge or experience of something to help you do something", "dic_examples": ["His novels draw heavily on his childhood."], "clc": "This report looks at the changes in eating habits in Italy, drawing on personal experience, magazine and newspaper articles and interviews with local people of different ages. ()"}], "draw sth up or draw up sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to prepare something, usually a plan, list, or an official agreement, by writing it", "dic_examples": ["She drew up a list of contestants."], "clc": "Government bodies have drawn up plans to educate people and explain to them why it is so important to keep our planet safe and clean. ()"}]}}, "drift": {"verb     [I]": {"drift apart": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If two people drift apart, they gradually become less friendly and the relationship ends.", "dic_examples": ["Roz used to be one of my closest friends, but we've drifted apart."], "clc": "Later on in our relationship we started to drift apart because, being a student from Canada, I had a lot of problems with Portuguese which led to my failure at the end of the school year. ()"}], "drift off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to gradually start to sleep", "dic_examples": [" I drifted off during the lecture. "], "clc": "She unwillingly let her mind drift off to her business trip in Milano. ()"}]}}, "drive": {"verb": {"drive sb/sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to force someone or something to leave a place", "dic_examples": ["The supermarket has driven many small shops out of the area."], "clc": "Unfortunately that kind of thinking led to many people being killed, wounded and made homeless and moreover driven out of their homeland. ()"}]}}, "dry": {"verb   [I or T]": {"dry up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If a supply of something dries up, it ends.", "dic_examples": ["The work dried up and he went out of business."], "clc": "Nevertheless we must consider that a society with many [people] over sixty has its problems, such as retirement funds which [have] dried up. ()"}]}}, "dwell": {"verb": {"dwell on/upon sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to keep thinking or talking about something, especially something bad or unpleasant", "dic_examples": ["I don't want to dwell on the past."], "clc": "Considering this astonishing technical feature, I do not wish to dwell too long upon the subject. ()"}]}}, "eat": {"verb": {"eat out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to eat in a restaurant", "dic_examples": ["When I lived in Spain, I used to eat out all the time."], "clc": "If you don't have any plans next weekend, I want to eat out with you. ()"}], "eat up (sth) or eat (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to eat all the food you have been given", "dic_examples": ["Be a good boy and eat up your dinner."], "clc": "There wasn't any more time after eating it up. ()"}]}}, "end": {"verb   [I or T]": {"end up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to finally be in a particular place or situation", "dic_examples": ["They're traveling across Europe by train and are planning to end up\n                             in Moscow.", "Much of this meat will probably end up as dog food.", "After working her way around the world, she ended up\n                             teaching English as a foreign language."], "clc": "After the movie we went for a drink and we ended up dancing salsa. ()"}]}}, "engage": {"verb   [T]": {"engage in sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to take part in something", "dic_examples": ["The two sides have agreed to engage in talks."], "clc": "Quite to the contrary, advocates and opponents of these happenings have engaged in a hot debate concerning their \"true\" value. ()"}]}}, "face": {"verb": {"face up to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to accept that a difficult situation exists", "dic_examples": ["Eventually, he faced up to his money problems."], "clc": "However, she had to face up to the fact that it was her duty to question the serial killer, to find out what his motives were. ()"}]}}, "fade": {"verb   [I or T]": {"fade away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to gradually become less strong or clear and then disappear", "dic_examples": ["With time, memories of that painful summer would fade away."], "clc": "These memories would never fade away, she knew it. ()"}]}}, "fall": {"verb                       [I]": {"fall apart": [{"gw": "BREAK", "gram": "", "is_phrase": false, "level": "B2", "definition": "to break into pieces", "dic_examples": ["My poor old boots are falling apart."], "clc": "It looks like it [is] going to fall apart any day. ()"}, {"gw": "HAVE PROBLEMS", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start having problems that you cannot deal with", "dic_examples": ["The deal fell apart because of a lack of financing.", "His life fell apart when his wife died."], "clc": "All her dreams and wishes fell apart. ()"}], "fall back on sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to use someone or something when other things have failed, or when there are no other choices", "dic_examples": ["We've been saving up the past few years, to have something to fall back on."], "clc": "Moreover, in an emergency, you can fall back on my neighbors. ()"}], "fall down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to fall onto the ground", "dic_examples": ["Our apple tree fell down in the storm.", "He stumbled and fell down."], "clc": "When I got up in the morning, I slip[ped] on a piece of soap and fell down. ()"}], "fall for sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to suddenly have strong romantic feelings about someone", "dic_examples": ["She fell for a tall, handsome Frenchman when she was on vacation in Paris."], "clc": "I saw a handsome boy [and] I fell for him. ()"}], "fall out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to argue with someone and stop being friendly with them", "dic_examples": ["She's fallen out with her sister.", "They fell out over money."], "clc": "My husband always blame[s] me and we fall out over my incapacity to cook. ()"}], "fall over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If someone or something falls over, they fall to the ground or onto their side.", "dic_examples": ["She tripped and fell over.", "The fence fell over in the wind."], "clc": "I nearly fell over because the corridor was very dark. ()"}], "fall through": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a plan or agreement falls through, it fails to happen.", "dic_examples": ["Our plans to go on vacation together fell through when Jamie got sick."], "clc": "All our plans fell through and I hope it will never happen to me again. ()"}]}}, "feast": {"verb": {"feast on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to eat a lot of food and enjoy it very much", "dic_examples": ["We feasted on fried chicken, ice cream, and chocolate cake."], "clc": "Some people think that traveling entails feasting on typical food and buying lots of clothes. ()"}]}}, "fend": {"verb": {"fend for yourself": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to take care of yourself without help", "dic_examples": ["When you go away to college, you have to learn to fend for yourself."], "clc": "For such people to be able to provide for their families and fend for themselves, they have to work irrespective of how they do the job. ()"}]}}, "figure": {"verb": {"figure out sth/sb or figure sth/sb out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to finally understand something or someone", "dic_examples": ["I can't figure out why he did it.", "I find him really strange - I can't figure him out at all."], "clc": "I couldn't figure out what had happened. ()"}]}}, "fill": {"verb": {"fill in/out sth or fill sth in/out": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to write the necessary information on an official document", "dic_examples": ["to fill in/out a form/questionnaire"], "clc": "Please fill in my form. ()"}], "fill up (sth) or fill (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to become full, or to make something become full", "dic_examples": ["The seats in the hall were filling up fast.", "Could you fill that bucket up with water for me?"], "clc": "I bought that [couch] just to fill up the space left. ()"}]}}, "find": {"verb           [T]": {"find out (sth) or find (sth) out": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to get information about something, or to learn a fact for the first time", "dic_examples": ["How did you find out about the party?", "I'll go find out what's going on\n                             outside.", "We need to find out why he's late.", "Too late, she found out that the train had been\n                             cancelled."], "clc": "I was at home when I found out that I had lost my cell-phone. ()"}]}}, "finish": {"verb": {"finish off sth or finish sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to complete the last part of something that you are doing", "dic_examples": ["I want to finish off this essay before I go to bed."], "clc": "NONE (NONE)"}]}}, "fit": {"verb": {"fit in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to feel that you belong to a particular group and are accepted by them", "dic_examples": ["He doesn't fit in with the other  pupils in his class."], "clc": "I do not think it is a good idea to advertise the club in a big way, it would not be very s[e]ri[o]us of us.  We could tell only the people that we think could fit in. ()"}], "fit in with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If one thing fits in with another thing, it belongs with them or they are suitable for each other.", "dic_examples": ["It's a very nice sofa but it doesn't fit in with the rest of\n                             the furniture."], "clc": "Nevertheless, there was something that wouldn't fit in with what Rollo would hear from Harry's friends. ()"}, {"gw": "SUCCESSFUL PART", "gram": "", "is_phrase": false, "level": "C1", "definition": "If  something fits in with a situation, idea, method, etc., it is suitable and works successfully as part of it.", "dic_examples": ["Changing location fits in with their plans to expand the business."], "clc": "In conclusion, I think your wedding day should be about you and your partner and the wedding celebrations should fit in with your combined ideas and cultures and wants to make it a memorable occasion for you and not to satisfy other people. ()"}]}}, "fix": {"verb        [T]": {"fix up sth or fix sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to repair of change something so it can be used or looks better", "dic_examples": ["She's almost finished fixing up her new apartment."], "clc": "But you can solve this problem in an easy way [by] just learning to fix up your bicycle, or taking it to the nearest repairing cent[er]. ()"}]}}, "flick": {"verb": {"flick through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to look quickly at the pages of a magazine, book, etc.", "dic_examples": ["I was just flicking through a magazine."], "clc": "Last week I happened to flick through a classical music magazine and was lucky enough to see an ad [saying that] the artist, or the pianist-conductor, would be performing all Beethoven's symphonies and piano concertos with the orchestra from next January. ()"}]}}, "flood": {"verb    [I or T]": {"be flooded with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to receive so many messages, phone calls, etc., that you cannot deal with them", "dic_examples": ["We were flooded with calls from worried parents."], "clc": "Soon he was being hired again and once word spread that the musician had returned, he was flooded with bookings. ()"}]}}, "focus": {"verb": {"focus (sth) on sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to give a lot of attention to one particular person, subject or thing", "dic_examples": ["Tonight's program focuses on the way that homelessness affects the young.", "When the kitchen is finished I'm going to focus my attention\n                             on the garden and get that fixed up."], "clc": "As you have probably guessed already, we are mainly interested in action movies and movies that focus on brutality and aggression. ()"}]}}, "follow": {"verb": {"follow up sth or follow sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to discover more about a situation or take further action in connection with it", "dic_examples": ["I follow up aerobic exercise with some weight lifting."], "clc": "Last year I started to take a lot of black and white photos and I wanted to follow up the process so I bought an enlarger with all the equipment to [go with] it. ()"}]}}, "frown": {"verb   [I]": {"frown on/upon sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to think that something is wrong and that you should not do it", "dic_examples": ["You can wear jeans, but I think the restaurant  frowns on shorts and sneakers."], "clc": "Talking being very often frowned upon in the Zen gardens, consequently it is peaceful and so you can fully relax and completely empty your head. ()"}]}}, "function": {"verb   [I]": {"function as sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to use for a particular purpose or in a particular way", "dic_examples": ["Our spare bedroom also functions as a study."], "clc": "In my point of view, the old building can function as a cafeteria for young people due to the fact that its location is in close proximity to the city center and people have the opportunity to pay a visit to the café and communicate with other people. ()"}]}}, "get": {"verb": {"get across sth or get sth across": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to manage to make someone understand or believe something", "dic_examples": ["We tried to get our point across, but he just wouldn't\n                             listen.", "This is the message that we want to get across to the public."], "clc": "I am going to get across several ideas to improve the look of our town. ()"}], "get along": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to have a good relationship", "dic_examples": ["She and her new roommate are getting along.", "He doesn't get along with his daughter.", "I get along well with most of her friends."], "clc": "She is a journalist at the local newspaper and we get along very well. ()"}], "get around (somewhere)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to travel or move from place to place", "dic_examples": ["The busses and subway make it easy to get around New York City."], "clc": "The island isn't too big so I think we could get around on foot. ()"}], "get around to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to do something that you have intended to do for a long time", "dic_examples": ["I still haven't got around to fixing that faucet."], "clc": "Dear Kim, I am terribly sorry not to drop you a line since the last time we wrote to one another. But I finally got around [to] writing and you'll see that it's defin[i]t[e]ly worth waiting as I have some great and unbeli[e]vable news to tell you. ()"}], "get at sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be able to reach or get something", "dic_examples": ["I've put the cake on a high shelf where the kids can't get at it."], "clc": "NONE (NONE)"}], "be getting at sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "If you ask someone what they are getting at, you are asking them what they really mean.", "dic_examples": ["What do you think the poet is getting at in these lines?"], "clc": "The point I'm getting at is that you have to understand that young people look at sport[s] like school: it's something you do that makes you feel good afterward and computer games are something you do when you have some spare time. ()"}], "get away": [{"gw": "ESCAPE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to leave or escape from a place or person, often when it is difficult to do this", "dic_examples": ["We walked to the next beach to get away from the crowds."], "clc": "[A] bicycle is a means of making new friends, and getting away from [your] daily routine. ()"}, {"gw": "GO SOMEWHERE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to go somewhere for a short vacation, often  because you need to rest", "dic_examples": ["I just need to get away for a few days."], "clc": "I've enjoyed the peace of getting away, you know I needed it. ()"}], "get away with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to succeed in not being criticized or  punished for something", "dic_examples": ["If I thought I could get away with it, I wouldn't pay any tax at all."], "clc": "When the police arrived, the criminals had already disappeared: they got away with this murder. ()"}], "get back": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to return to a place after you have been somewhere else", "dic_examples": ["When we got back to the hotel, Ann had already left.", "If you get back in time, you can come with us."], "clc": "Will call you when I get back. ()"}], "get back sth or get sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be given something again that you had before", "dic_examples": ["He went next door to get his ball back.", "Don't lend him money, you'll never get it back."], "clc": "He hoped that he would get back his suitcase. ()"}], "get back to sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to talk or write to someone at a later time to give them some information they asked for or because you were not able to speak to them before", "dic_examples": ["I need to get back to Gary about his new computer."], "clc": "I am awfully sorry for having been slow in getting back to you. ()"}], "get sb down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make someone feel unhappy", "dic_examples": ["All this uncertainty is really getting me down."], "clc": "But when I had finally reached the bottom of the valley seeing the whole ski group staring at me, the embarras[s]ment got me down. ()"}], "get down to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start doing something seriously and with a lot of attention and effort", "dic_examples": ["Before we get down to business, I'd like to thank you all for coming today."], "clc": "Let's get down to business! ()"}], "get in": [{"gw": "ENTER", "gram": "", "is_phrase": false, "level": "B1", "definition": "to succeed in entering a place, especially a building", "dic_examples": ["They must have gotten in through the bathroom window."], "clc": "[W]e had to hang out in front of the Museum for almost one hour. When we finally got in there, the tour was very short. ()"}, {"gw": "ARRIVE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to arrive at a place at a particular time", "dic_examples": ["My flight gets in at 9:45 p.m.", "When does Elaine get in?"], "clc": "NONE (NONE)"}, {"gw": "BE CHOSEN", "gram": "", "is_phrase": false, "level": "B2", "definition": "to succeed in being chosen or elected", "dic_examples": ["He wanted to go to Stanford, but he didn't get in."], "clc": "For the first time I was trying to get in a University or a High College. ()"}], "get into sth": [{"gw": "BE CHOSEN", "gram": "", "is_phrase": false, "level": "B2", "definition": "to succeed in being chosen or elected", "dic_examples": ["He got into Harvard."], "clc": "A month later on, I finally got into a High College of Education, but almost 400 km from home. ()"}, {"gw": "BE INTERESTED", "gram": "", "is_phrase": false, "level": "C1", "definition": "to become interested in an activity or subject, or start being involved in an activity", "dic_examples": ["How did you get into journalism?"], "clc": "Taking everything into account, I truly believe that \"Ethnos\" is the most suitable newspaper to be placed in the library [...] for every student who would like to learn Greek deeply and get into the Greek culture and civili[z]ation. ()"}], "get off (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to leave a bus, train, aircraft or boat", "dic_examples": ["We should get off at the next stop."], "clc": "Then get off the bus in Obdland Village [and] walk up the road. ()"}], "get on (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to go onto a bus, train, aircraft or boat", "dic_examples": ["I think we got on the wrong bus."], "clc": "Last Saturday I was running to get on the bus, but my schoolbag was open and the diary fell [out]. ()"}], "get on with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to continue doing something, especially work", "dic_examples": ["We don’t have all day to finish this job, so can we just get on with it?"], "clc": "I must go and get on with my homework. ()"}], "get out": [{"gw": "LEAVE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to leave a closed vehicle, building, etc.", "dic_examples": ["I'll get out when you stop at the traffic light."], "clc": "Suddenly the lights went out and I was there, desper[ately] trying to find a way to get out of the house! ()"}, {"gw": "DIFFERENT PLACES", "gram": "", "is_phrase": false, "level": "C1", "definition": "to go out to different places and meet people in order to enjoy yourself", "dic_examples": ["She doesn't get out as much now that she had the baby."], "clc": "Since Internet, e-mails and mobile phones were invented, fewer people get out and meet friends. ()"}], "get out of sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to avoid doing something that you do not want to do, especially by giving an excuse", "dic_examples": ["If I can get out of going to the meeting tonight I will."], "clc": "I must go to Tokyo on business that Wednesday afternoon. This is a kind of step up for me and I can't get out of it. ()"}], "get (sb/sth) out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to escape from or leave a place, or to help someone do this", "dic_examples": ["I left the door open and the cat got out."], "clc": "\"Don't panic, now, Lorraine\", he answered me. \"He may be a little .... um, eccentric, but I'm sure he'll get us out of here fine.\" ()"}], "get over sth/sb": [{"gw": "GET BETTER", "gram": "", "is_phrase": false, "level": "B2", "definition": "to get better after an illness, or feel better after something or someone has made you unhappy", "dic_examples": ["She's still getting over the flu.", "It took her months to get over the shock of Richard leaving."], "clc": "First of all, she had had to get over the deaths of three close relatives in the last three years. ()"}, {"phrase": "can't/couldn't get over <i>sth</i>", "is_phrase": true, "level": "B2", "definition": "to be very shocked or surprised about something", "dic_examples": ["I can't get over how different you look with short hair."], "clc": "I can't get over how quickly you wrote to me. ()"}], "get through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to succeed in an examination or competition", "dic_examples": ["She got through her exams without too much trouble."], "clc": "I know you want to get through your exams. ()"}], "get (sb) through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to deal with a difficult or unpleasant experience, or to help someone do this", "dic_examples": ["My friendship with Carla got me through those tough months just after we moved.", "We'll get you through this, Karen."], "clc": "You see, my friend, how li[f]e can be a bit difficult but people manage to get through it. ()"}], "get through to sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to succeed in making someone understand or believe something", "dic_examples": ["I just don't seem to be able to get through to him these days."], "clc": "He should make the lesson interesting and should manage to get through to children. ()"}], "get to sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make someone feel upset or angry", "dic_examples": ["I know he's annoying but you shouldn't let him get to you."], "clc": "But they are overprotective and it gets to me very much. ()"}], "get together": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to meet in order to do something or spend time together", "dic_examples": ["A few of us are getting together next week for a drink."], "clc": "During [a] Chinese wedding cer[e]mony, new couples wear traditional clothes and hold a party for friends and families getting together. ()"}], "get up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stand up", "dic_examples": ["The whole audience got up and started clapping."], "clc": "When I got up on my feet again I reached out my arm to get a hold on something, but there w[as]n't anything to hold on to. ()"}], "get (sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "A1", "definition": "to wake up and get out of bed, or make someone do this", "dic_examples": ["I had to get up at five o'clock this morning.", "Could you get the kids up?"], "clc": "My friend gets up early. ()"}]}}, "give": {"verb                            [T]": {"give away sth or give sth away": [{"gw": "FREE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to give something to someone without asking for payment", "dic_examples": ["The bakery is giving away a sample to every customer."], "clc": "She decided to give away everything she had and go to a place where nobody could find her. ()"}, {"gw": "SECRET", "gram": "", "is_phrase": false, "level": "B2", "definition": "to tell people something secret, often without intending to", "dic_examples": ["The party was supposed to be a surprise, but Sharon gave it away."], "clc": "He gave Matthew's secret away and this made his life come to an end. ()"}], "give back sth or give sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to return something to the person who gave it to you", "dic_examples": ["Has she given you those books back yet?"], "clc": "Please give it back to me tomorrow. ()"}], "give in": [{"gw": "AGREE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to finally agree to what someone wants, after refusing for a period of time", "dic_examples": ["He nagged me so much for a new bike that eventually I gave in."], "clc": "What you should do is talk to your parents and explain your problem to them. [Your] parents may give in! ()"}, {"gw": "ADMIT DEFEAT", "gram": "", "is_phrase": false, "level": "B2", "definition": "to accept that you have been defeated and agree to stop competing or fighting", "dic_examples": ["You'll never guess the answer - do you give in?"], "clc": "NONE (NONE)"}], "give out sth or\n                give sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to give something to a large number of people", "dic_examples": ["Please give these worksheets out, Maria.", "I said I'd give out leaflets for them in town."], "clc": "At the concert, what I had to do was to give out refreshments to the audience. ()"}], "give up sth or give sth up": [{"gw": "ACTIVITY", "gram": "", "is_phrase": false, "level": "B1", "definition": "to stop doing a regular activity or job", "dic_examples": ["We're going to give up our sports club membership after this year."], "clc": "I believe that you should continue sports rather than music for as you mentioned in your letter you have always done sports and you can't give all that up for music classes. ()"}, {"gw": "HABIT", "gram": "", "is_phrase": false, "level": "B1", "definition": "If you give up a habit, such as smoking, or something such as alcohol, you stop doing it or using it.", "dic_examples": ["I gave up smoking two years ago."], "clc": "The reason why he is not happy could be that he can't give up drinking so much and it gets him down. ()"}], "give up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop doing an activity or piece of work before you have completed it, usually because it is too difficult", "dic_examples": ["I had to give up halfway through the race."], "clc": "The most important thing is that you should keep doing it. Don't give up!! ()"}]}}, "glue": {"verb   [T]": {"be glued to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to be watching something, especially television", "dic_examples": [" The kids were glued to the TV all morning."], "clc": "In general, it can be said that the modern mass obsession with television has led to the fact that more people now[a]days lead a sedentary way of life, not to mention [their being] couch potatoes, glued to the screen [for] most of their leisure time. ()"}]}}, "go": {"verb": {"go ahead": [{"gw": "START", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start to do something", "dic_examples": ["We now have permission to go ahead with the project.", "The vote will go ahead today as planned."], "clc": "I felt depressed under my parents' pressure, but I had something stronger deep inside of me saying that I should go ahead with my [plan]. ()"}, {"gw": "ALLOW", "gram": "", "is_phrase": false, "level": "B2", "definition": "something that you say to someone to allow them to do something", "dic_examples": ["\"Can I borrow your book?\" - \"Yes, go ahead.\""], "clc": "Everyone needs something sweet from time to time. Go ahead but don't eat it too often, eat more fruit and veg[e]tables! ()"}], "go away": [{"gw": "LEAVE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to leave a place", "dic_examples": ["Just go away and leave me alone, will you?"], "clc": "[A] big dog appeared. We were very scared. However, the dog went away and we [were able to] spend a beautiful day, walking, and breathing clean air. ()"}, {"gw": "VACATION", "gram": "", "is_phrase": false, "level": "B1", "definition": "to leave your home in order to spend time in a different place", "dic_examples": ["We're going away for a few weeks in the summer."], "clc": "My grandparents had gone away for a week. ()"}], "go back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to return to a place where you were or where you have been before", "dic_examples": ["When are you going back to Paris?", "It had started to rain so I went back for my keys.", "Is she well enough to go back to work?"], "clc": "So I went back to the classroom, picked up my bag and went home. ()"}], "go by": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If time goes by, it passes.", "dic_examples": ["The days went by really slowly."], "clc": "The night went by slowly and my family and I had a great time and a lot of fun. ()"}], "go down": [{"gw": "BECOME LESS", "gram": "", "is_phrase": false, "level": "B1", "definition": "to become lower in level", "dic_examples": ["House prices have gone down recently."], "clc": "Here in my city the temperature is going down, in the newspaper I read that this winter may be the coldest in many years so I'[d] like to buy a coat soon. ()"}, {"gw": "SUN", "gram": "", "is_phrase": false, "level": "B1", "definition": "When the sun goes down, it moves down in the sky until it cannot be seen any more.", "dic_examples": ["I sat with Ken and Olga and watched the sun go down."], "clc": "Late in the [evening] we can go to the beach and see the sun go down. ()"}], "go for sth": [{"gw": "CHOOSE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to choose something", "dic_examples": ["I don't know whether to go for the fish or the steak."], "clc": "Please, in your next letter, let me know what kind of shopping you go for. ()"}, {"gw": "TRY TO GET", "gram": "", "is_phrase": false, "level": "B2", "definition": "to try to get or achieve something", "dic_examples": ["He'll be going for his fifth Olympic gold medal.", "\"I'm going to apply for that job.\" \"Yeah, go for it!\" "], "clc": "NONE (NONE)"}], "go in": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to enter a place", "dic_examples": ["I looked through the window but I didn't go in."], "clc": "Surprisingly there w[as] no one in the house so I used the key to open the door [and] then I went in. ()"}], "go off": [{"gw": "LEAVE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to leave a place and go somewhere else", "dic_examples": ["They've gone off to the diner."], "clc": "Luckily someone came along soon afterwards and they went off to phone for an ambulance which brought us here. ()"}, {"gw": "STOP WORKING", "gram": "", "is_phrase": false, "level": "B1", "definition": "If a light or machine goes off, it stops working.", "dic_examples": ["The heating goes off at 10 o'clock."], "clc": "Suddenly the computer shut down and the light went off. ()"}, {"gw": "MAKE NOISE", "gram": "", "is_phrase": false, "level": "B2", "definition": "If something that makes a noise goes off, it suddenly starts making a noise.", "dic_examples": ["His car alarm goes off every time it rains."], "clc": "Unfortunately one of those buttons was the alarm which should be pressed in case of fire and it went off and all the staff from the restaurant came downstairs quickly. ()"}, {"gw": "EXPLODE", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a bomb or a gun goes off, it explodes or fires.", "dic_examples": ["A bomb went off in the parking lot, killing three people."], "clc": "NONE (NONE)"}], "go on": [{"gw": "CONTINUE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to continue to happen or exist", "dic_examples": ["The meeting went on until six o'clock.", "The path seemed to go on forever.", "I know she's upset about losing her job, but life goes on."], "clc": "Jonathan, this can't go on any more, this week you spent with me I could see you have been working too hard. ()"}, {"gw": "HAPPEN", "gram": "", "is_phrase": false, "level": "B1", "definition": "to happen", "dic_examples": ["Why aren't they here yet? What's going on?"], "clc": "\"What is going on?\", I asked. ()"}, {"gw": "CONTINUE DOING", "gram": "", "is_phrase": false, "level": "B2", "definition": "to continue doing something", "dic_examples": ["We can't go on living like this.", "She went on talking as though nothing had happened."], "clc": "There are many people who think that even if technology improves, our lifestyles will not change much. They think we will go on dealing with problems at home as we [have always done]. ()"}], "go out": [{"gw": "LEAVE", "gram": "", "is_phrase": false, "level": "A1", "definition": "to leave a place in order to go somewhere else", "dic_examples": ["Are you going out tonight?"], "clc": "I like to go out with my friends. ()"}, {"gw": "RELATIONSHIP", "gram": "", "is_phrase": false, "level": "B1", "definition": "If two people go out together, they have a romantic relationship with each other.", "dic_examples": ["I've been going out with Peter for a year.", "Dan and I have been going out for over two years now."], "clc": "Her name is Francesca and I met her at university. She is very nice, so we decided to go out together. ()"}, {"gw": "LIGHT/FIRE", "gram": "", "is_phrase": false, "level": "B1", "definition": "If a light or something that is burning goes out, it stops producing light or heat.", "dic_examples": ["Should I put some more wood on the fire or let it go out?"], "clc": "I have never beli[e]ved in ghost[s], but why did the lights go out? ()"}], "go over sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to examine something, such as a piece of writing or some numbers, in order to make sure that it is correct", "dic_examples": ["I'm just going over these figures one more time."], "clc": "NONE (NONE)"}], "go through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to experience a difficult or unpleasant situation or event", "dic_examples": ["She's going through a difficult time at her job."], "clc": "We went through a dreadful experience you can be sure. ()"}], "go up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to become higher in level", "dic_examples": ["Food prices keep going up."], "clc": "You should have a lot of money because the cost of li[ving] is going up. ()"}]}}, "grasp": {"verb    [T]": {"grasp at sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to quickly try to get hold of something", "dic_examples": ["She grasped at the bushes as she fell."], "clc": "There was half a minute of horror-stricken silence, then a soft moan left her slightly parted lips as she grasped at the wooden door frame for balance. ()"}]}}, "grow": {"verb": {"grow up": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to gradually become an adult", "dic_examples": ["I grew up in Scotland."], "clc": "I have grown up eating this kind of food. ()"}]}}, "hand": {"verb       [T]": {"hand sth down or hand down sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to pass possessions or traditions from older people to younger ones", "dic_examples": ["a custom handed down through the generations", "This clock was handed down from my great-grandfather to my grandfather, then to my mother, and now to me."], "clc": "The ring is of great significance to me as it was handed down from generation to generation, and I was the lucky one, who inherited it from my grandmother. ()"}], "hand in sth or hand sth in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to give a piece of written work to a teacher", "dic_examples": ["Have you handed in your homework yet?"], "clc": "NONE (NONE)"}], "hand out sth or hand sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to give something to each person in a group or place", "dic_examples": ["The teacher asked her to hand out the worksheets.", "They stood on the street corner handing out leaflets."], "clc": "I handed out refreshment[s] to the pop group's members during breaks - my friends were so jealous of me! ()"}], "hand  over sb/sth or hand sb/sth over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to give someone or something to someone else", "dic_examples": ["The hijacker was handed over to the French police.", "They were ordered to hand over their weapons."], "clc": "In the end, we handed them over to the police and we were rewarded. ()"}]}}, "hang": {"verb": {"hang around (swh)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to spend time somewhere, usually doing very little", "dic_examples": ["There's nowhere for teenagers to go so they just hang around on street corners."], "clc": "It was great because the whole time I was able to ride my skateboard and hang around with my friends, and I had a lot of fun. ()"}], "hang on": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to wait for a short time", "dic_examples": ["Hang on a minute while I see if Steve can come to the phone.", "Can you hang on for a little longer until we're finished?", "Hang on  - I'll be with you in a minute!"], "clc": "If I were you, I would take my job with more calm and I wouldn't be nervous when talking on [the] telephone, hang[ing] on waiting for an answer. ()"}], "hang out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to spend a lot of time in a place or with someone", "dic_examples": ["We like hanging out at the mall.", "I've been hanging out backstage with the band."], "clc": "For example, when I hang out with my friends, I love wearing a skirt. ()"}], "hang up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to finish a conversation on the telephone", "dic_examples": ["She said goodbye and hung up."], "clc": "Then he hung up immediately. ()"}], "hang up sth or hang sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to put something, especially a piece of clothing, somewhere where it can hang", "dic_examples": ["You can hang up your jacket over there."], "clc": "The first problem I would like to mention is what everybody in our class knows: we have to hang up more signs, which show the way to the reception, because visitors and new students have lots of problems find[ing] it. ()"}]}}, "have": {"verb                      [T]": {"have on sth or have sth on": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If you have clothes or shoes on, you are wearing them.", "dic_examples": ["He's got a red shirt on.", "I loved that dress you had on last night."], "clc": "I looked [over] my shoulder and there was Nora as white as the dress she had on. ()"}]}}, "head": {"verb": {"be heading for sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be likely to experience a bad situation soon", "dic_examples": ["They'll be heading for trouble if they're not careful.", "The country is heading for a recession."], "clc": "Mankind is heading for the future sometimes faster than we think. ()"}], "head off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start to leave a place or begin a trip, walk, etc.", "dic_examples": ["We'll head off after lunch."], "clc": "After being snowed in, the following morning we headed off to Las Vegas. ()"}]}}, "hear": {"verb": {"hear from sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If you hear from someone, you get a letter, a message, or a telephone call from them, or they tell you something.", "dic_examples": ["We haven't heard from her for a long time.", "You'll be hearing from my lawyer."], "clc": "I didn't hear from my friend for a long time. ()"}], "have heard of sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If you have heard of someone or something, you know that that person or thing exists.", "dic_examples": ["I'd never heard of him before he won the prize.", "It's a tiny country that most people have never heard of."], "clc": "The old man had never heard of the Dark Duck, so he asked Paul what it was. ()"}]}}, "heat": {"verb": {"heat up sth or heat sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make food hot so that it can be eaten", "dic_examples": ["I'll just heat up the soup."], "clc": "Do not spend your money on fast-food restaurants, and do not buy meals to heat up in your microwave. ()"}]}}, "help": {"verb       [I or T]": {"help out (sb) or help (sb) out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to help someone, especially by giving them money or working for them", "dic_examples": ["Sophia has been helping out in the store this week.", "Her parents helped her out with the cost of college."], "clc": "I helped out my friend by writing huge billboards and making some light refreshments. ()"}]}}, "hit": {"verb       [T]": {"hit it off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If people hit it off, they like each other and become friendly immediately.", "dic_examples": ["Carla and Nina didn't really hit it off."], "clc": "They hit it off immediately. ()"}]}}, "hold": {"verb                           [T]": {"hold sth against sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to like or respect someone less because they have done something wrong or behaved badly", "dic_examples": ["It was his mistake but I won't hold it against him."], "clc": "When my Dad was about sixteen, he had to get a job. [...] My uncle on the other hand was al[lowe]d to study until he was 21. They have never held it against each other, as far as I know. ()"}], "hold sb/sth back": [{"gw": "PREVENT MOVEMENT", "gram": "", "is_phrase": false, "level": "C1", "definition": "to prevent someone or something from moving forward", "dic_examples": ["The police held back the protesters."], "clc": "At last, the guards were able to temporarily hold them back. ()"}, {"gw": "PREVENT PROGRESS", "gram": "", "is_phrase": false, "level": "C2", "definition": "to prevent someone or something from making progress", "dic_examples": ["She felt staying in the same job would hold her back."], "clc": "For years, nothing could hold her back, and she didn't realize how her huge amount of self-confidence prevented her from seeing life as it really was. ()"}], "hold back sth or hold sth back": [{"gw": "NOT TELL", "gram": "", "is_phrase": false, "level": "C1", "definition": "to not tell everything you know about something", "dic_examples": ["I think she suspected I was holding something back."], "clc": "To be honest, I am holding back a lot more things special about the cottage, because I want you to come and have a look. ()"}, {"gw": "EMOTION", "gram": "", "is_phrase": false, "level": "C2", "definition": "to stop yourself from showing an emotion", "dic_examples": ["She couldn't hold back the tears."], "clc": "In the last scenes, I could not hold back my tears any longer and I just burst into tears. ()"}], "hold down a job": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to keep a job", "dic_examples": ["It can be difficult for a mother to hold down a full-time job."], "clc": "I don't know how long I'd manage to hold down a job that I d[id]n't like, and that d[id]n't bring me anything other than money. ()"}], "hold off (sth/doing sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to wait before doing something", "dic_examples": ["We'll hold off making a decision until we hear from Nick."], "clc": "NONE (NONE)"}], "hold on": [{"gw": "WAIT", "gram": "", "is_phrase": false, "level": "B1", "definition": "to wait for a short time", "dic_examples": ["Hold on - I have another call coming in."], "clc": "I've a lot of good stories to tell you about so hold on. ()"}, {"gw": "CONFUSED/SURPRISED", "gram": "", "is_phrase": false, "level": "C1", "definition": "something you say when you are confused or surprised by something that you have just heard or read and want to understand it", "dic_examples": ["Hold on, if Sara's not coming, why are we asking for a table for six?"], "clc": "NONE (NONE)"}], "hold onto sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to hold something firmly or to keep something", "dic_examples": ["Hold onto the rope and don't let go.", "The team held onto first place with a 4-3 win last night."], "clc": "I take my poetry book with me all the time to hold onto something so important to me. ()"}], "hold out hope": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to think that something is likely to succeed or have a good result", "dic_examples": ["Few people hold out any hope of finding more survivors of the earthquake."], "clc": "To be honest, I don't hold out much hope that this problem will ever be solved, because homelessness doesn't affect MPs personally. ()"}], "hold\n                up sb/sth or hold sb/sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to make something or someone slow or late", "dic_examples": ["We got held up by the traffic."], "clc": "Then I was held up in a traffic jam. ()"}]}}, "hope": {"noun     [C or U]": {"hold out hope": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to think that something is likely to succeed or have a good result", "dic_examples": ["Few people hold out any hope of finding more survivors."], "clc": "To be honest, I don't hold out much hope that this problem will ever be solved, because homelessness doesn't affect MPs personally. ()"}]}}, "hurry": {"verb    [I or T]": {"hurry up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to do something more quickly", "dic_examples": ["Hurry up, or we'll miss the bus."], "clc": "I woke up at 9 a.m. I had to hurry up because my flight was at 11 a.m. ()"}], "hurry up sb/sth or hurry sb/sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make someone do something more quickly, or to make something happen sooner", "dic_examples": ["Can't you hurry the kids up so we can get there on time?", "What he did was to hurry up the process."], "clc": "NONE (NONE)"}]}}, "identify": {"verb    [T]": {"identify with sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to feel that you are similar to someone, and can understand them or their situation because of this", "dic_examples": ["Readers can easily identify with the hero's sense of frustration at the beginning of the novel."], "clc": "Orwell give[s] the animals human characteristics and we can identify with them. ()"}]}}, "insist": {"verb    [I]": {"insist on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to keep doing something, even if it annoys other people or people think it is not good for you", "dic_examples": ["She insists on cooking all her own meals.", "Frank insisted on doing all the work himself."], "clc": "Young people often insist on doing everything on their own and consider advice almost an attack on their personal opinion. ()"}]}}, "join": {"verb": {"join in (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to become involved in an activity with other people", "dic_examples": ["We only need one more person to be able to play a game - can you persuade your sister to join in?", "If you know the song, we'd like everyone to join in on\n                             the chorus."], "clc": "Generally I'm not interested in that [sort of] thing but I found it interesting, so I decided to join in. ()"}]}}, "keep": {"verb": {"keep at sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to continue working hard at something difficult", "dic_examples": ["Learning a language is hard but you've just got to keep at it."], "clc": "Despite the fact that it requires patience, one should not work oneself up into a frenzy but keep at it. ()"}], "keep (sb/sth) away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to not go somewhere or near something, or to prevent someone from going somewhere or near something", "dic_examples": ["I told them to keep away from the edge of the cliff."], "clc": "But the animals themselves are being kept away from their natural environment in captivity. ()"}], "keep (sb/sth) back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to not go near something, or to prevent someone or something from going past a particular place", "dic_examples": ["The police struggled to keep the crowd back."], "clc": "NONE (NONE)"}], "keep down sth or keep sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop the number, level, or size of something from increasing", "dic_examples": ["I have to exercise to keep my weight down."], "clc": "That's also a way of keeping down the many accidents we have from fast cycling. ()"}], "keep sb/sth from doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to prevent someone or something from doing something", "dic_examples": ["Try to keep the children from dropping food all\n                             over the floor."], "clc": "But its beautiful graphics and very rich text will keep you from complaining too much. ()"}], "keep sth from sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to not tell someone about something", "dic_examples": ["Is there something you're keeping from me?"], "clc": "They kept it from me. ()"}], "keep sb in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to make a child stay inside, often as a punishment, or to make someone stay in a hospital", "dic_examples": ["She kept the children in because it was so cold."], "clc": "NONE (NONE)"}], "keep (sb/sth) off sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to not go onto an area, or to stop someone or something going onto an area", "dic_examples": ["Keep off the grass."], "clc": "NONE (NONE)"}], "keep sth off (sb/sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop something touching or harming someone or something", "dic_examples": ["He put a cloth over the food to keep the flies off."], "clc": "NONE (NONE)"}], "keep on doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to continue to do something, or to do something again and again", "dic_examples": ["She kept on asking me questions the whole time."], "clc": "I kept on looking for him outside my building and in the park, but I still [haven't found] him. ()"}], "keep (sb/sth) out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to not go into a place, or to stop someone or something from going into a place", "dic_examples": ["The building was unsafe so they put up a sign saying \"Danger - Keep out.\""], "clc": "NONE (NONE)"}], "keep to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If you keep to a plan/subject/path, etc., you stay with it.", "dic_examples": ["We need to keep to the agenda or the meeting will take too long.", "I wish you'd keep to the point!", "She kept to the main roads and was home before dark."], "clc": "When the zoos keep to these and other important and necessary conditions and rules, I think it is not cruel to keep animals in zoos. ()"}], "keep sth to yourself": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If you keep something to yourself, you do not tell anyone else about it.", "dic_examples": ["She usually keeps her opinions to herself."], "clc": "She kept her thoughts to herself, her best friend being her diary. ()"}], "keep up sth or keep sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to continue doing something or not allow it to fall to a lower level", "dic_examples": ["Keep up the good work.", "Make sure you eat - you've got to keep your strength up."], "clc": "This is my advice: give up sports to keep up your music classes. ()"}], "keep up (with sb/sth)": [{"gw": "SAME SPEED", "gram": "", "is_phrase": false, "level": "B2", "definition": "to move at the same speed as someone or something that is moving forward so that you stay level with them", "dic_examples": ["She was walking so fast I couldn't keep up with her."], "clc": "Unfortunately he was too fast and I couldn't keep up with him. ()"}, {"gw": "UNDERSTAND", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be able to understand or deal with something that is happening or changing very fast", "dic_examples": ["It's important to keep up with international news."], "clc": "I live in London and I have to keep up with Turkish news for my job. ()"}], "keep up (with sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to increase or make progress at the same speed as something or someone else so that you stay at the same level as them", "dic_examples": ["Prices have been rising very fast and wages haven't kept up."], "clc": "We need more and more of our natural [resources] to be able to keep up with the rise in population. ()"}], "keep (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to continue doing something or continue something without change", "dic_examples": ["He was having trouble keeping up the payments on his car."], "clc": "The reason why a person becomes homeless is that he or she is not able to pay the rent or fails to keep up the mortgage payments. ()"}]}}, "kick": {"verb       [I or T]": {"kick in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start to be effective or to happen", "dic_examples": ["The new tax rate kicks in next month."], "clc": "It is at this time that the hormones start to kick in resulting in most of them having to suffer the side effects. ()"}], "kick off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "When an event kicks off, it begins.", "dic_examples": ["What time does the parade kick off?"], "clc": "Not only did [the invention of the wheel] improve daily movements, but also it kicked off a much faster and easier way of traveling all over the world. ()"}], "kick (sth) off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "When you kick off a discussion or activity, you start it.", "dic_examples": ["Should we kick off the session with a presentation from Lisa?"], "clc": "NONE (NONE)"}], "kick sb out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to force someone to leave a place or organization", "dic_examples": ["The store is closing - we should leave before they kick us out."], "clc": "He will kick you out of his house without thanking you. ()"}]}}, "knock": {"verb": {"knock sb down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to hit someone with a vehicle and injure or kill them", "dic_examples": ["She was knocked down by a bus."], "clc": "The man explained that Lime was knocked down by a car and that he died immediately. ()"}], "knock sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to destroy a building or part of a building", "dic_examples": ["They've knocked down the old movie theater."], "clc": "Since many of the office building are almost empty I also think that we should have them knocked down and replaced by green parks or other areas where no cars are to be allowed. ()"}], "knock sb out": [{"gw": "HIT SOMEONE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make someone become unconscious, usually by hitting them on the head", "dic_examples": ["He was knocked out halfway through the fight."], "clc": "Chris knocked him out with a strong punch without doubting that he was a criminal. ()"}, {"gw": "DEFEAT IN COMPETITION", "gram": "often passive", "is_phrase": false, "level": "B2", "definition": "to defeat a person or team in a competition so they cannot take part any more", "dic_examples": ["The Canadian team was knocked out in the semifinal."], "clc": "NONE (NONE)"}], "knock sth/sb over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to hit or push something or someone, especially accidentally, so that they fall to the ground or onto their side", "dic_examples": ["I knocked a bottle of wine over while I was reaching for a dish.", "He banged into me so hard that he nearly knocked me over."], "clc": "I knocked over the girl's cup, which was still full of milk. ()"}]}}, "know": {"verb": {"know of sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to have heard of something or someone and have a little information about them", "dic_examples": ["I know of a good restaurant near the theater."], "clc": "I know of a good restaurant that has opened recently and it's near your new apartment, so I suggest we go and try out the marvelous Chinese dishes the day after the concert. ()"}]}}, "laugh": {"verb    [I]": {"laugh at sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to show that you think someone or something is stupid", "dic_examples": ["I can't go into work looking like this - everyone will laugh at me.", "If you say that, people will just laugh at you."], "clc": "All my friends laughed at me. ()"}]}}, "lay": {"verb       [T]": {"lay sb off or lay off sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop employing someone, usually because there is no work for them to do", "dic_examples": ["Because of falling orders, the company has been forced to lay off several hundred\n                             workers."], "clc": "Dear Madam, I am John Smith, I work in a factory although it will not be for a long time because the company is beginning to lay off a lot of workers. ()"}], "lay sth out or lay out sth": [{"gw": "EXPLAIN", "gram": "", "is_phrase": false, "level": "C1", "definition": "to explain something clearly, usually in writing", "dic_examples": ["We have asked them to lay out their plans for the future of the park."], "clc": "I would like you to rewrite the colum[n], making all the changes I have laid out for you. ()"}, {"gw": "ARRANGE", "gram": "", "is_phrase": false, "level": "C1", "definition": "to arrange or design something, or to show how the parts of something will fit together", "dic_examples": ["The designer laid out the book with pictures on every page."], "clc": "By studying the effects of rain and ways to handle the expected amount of water one can plan the laying out of the new roads and correct the deficiencies in the present ones. ()"}, {"gw": "SPEND", "gram": "", "is_phrase": false, "level": "C2", "definition": "to spend money, especially if it seems like a large amount", "dic_examples": ["He has laid out $40,000 to fund Little League teams in California."], "clc": "It is their character, their interests or maybe some su[b]tle power that makes people lay out a vast sum of money for a picture of a piece of jewelry. ()"}]}}, "lead": {"verb": {"lead to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to cause something to happen or exist", "dic_examples": ["Reducing speed limits led to fewer fatal highway accidents."], "clc": "People who work very hard are often tired, which could influence their relationship with others. It might lead to unnecessary arguments and spoil the pleasant atmosphere among them for some time. ()"}], "lead up to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to happen before an event", "dic_examples": ["The pilot had no recollection of the events leading up to the crash."], "clc": "We want to know what happened to those civilizations, what were their beliefs, [...] what were their dreams and predictions [for] the future, what events and actions have led up to the present? ()"}]}}, "lean": {"verb      [I or T]": {"lean on sb": [{"gw": "DEPEND ON", "gram": "", "is_phrase": false, "level": "C2", "definition": "to depend on someone or something", "dic_examples": ["They had leaned on the dictionary as the authority that answered all their questions."], "clc": "I would like to be the person my child can always lean on: I'd like to be able to express my feelings and make him express his. ()"}, {"gw": "CONVINCE", "gram": "", "is_phrase": false, "level": "C2", "definition": "to try to convince or force someone do what you want", "dic_examples": ["The other members will probably lean on her to get her to stay."], "clc": "Piggy is the most intelligent boy of the group, but he doesn't have the streng[th] to apply his ideas to the situation they are living [in], that is why he leans on Ralph (the perfect leader-type, as he sees him). ()"}]}}, "leap": {"verb": {"leap at sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to accept the chance to have or do something with enthusiasm", "dic_examples": [" I'd leap at the opportunity to work in Japan."], "clc": "I was offered a job abroad, a hig[h]ly paid one, and I decided to leap at the chance and avail myself [of] this God-sent opportunity!\" ()"}]}}, "leave": {"verb": {"leave behind sb/sth or leave sb/sth behind": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to leave a place without taking someone or something with you", "dic_examples": ["We were in a hurry and I think I must have left my keys behind.", " The flood victims were forced to leave behind family photos and mementos."], "clc": "I know you must be disappointed [at] having to move, leaving all your friends behind, but it's OK, I'm sure you'll make new ones. ()"}], "leave out sb/sth or leave sb/sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to not include someone or something", "dic_examples": ["You can leave the butter out of this recipe if you're on a low-fat diet.", "I made a list of names - I hope I didn't leave anyone out.", "She doesn't know any of the other children and I think she feels left out."], "clc": "She felt so left out. ()"}]}}, "let": {"verb": {"let sb down or let  down sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to disappoint someone by failing to do what you agreed to do", "dic_examples": ["I promised to go to a movie with Beth and I don't want to let her down."], "clc": "I promise you that I am not going to let you down. ()"}], "let sb off or let off sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to not punish someone who has done something wrong, or to not punish them severely", "dic_examples": ["Instead of a prison sentence they were let off with a fine.", "You won't be let off so lightly\n                              the next time."], "clc": "Although the headmaster let me off with a warning when I explained the matter to him, I was very depressed because I was exhausted. ()"}], "let out sb/sth or let sb/sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to allow a person or animal to leave a place, especially by opening a locked or closed door", "dic_examples": ["I heard a voice from the closet shouting \"Let me out!\""], "clc": "Then, hopefully, the animals can be let out in[to] their natural enviro[n]ment again. ()"}]}}, "lie": {"verb       [I]": {"lie ahead": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "If an event or situation that will cause problems lies ahead, it will happen in the future.", "dic_examples": ["He's under no illusions about the difficulties that lie ahead for the industry."], "clc": "They help prepare our children for what lies ahead of them. ()"}], "lie down": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to move into a position in which your body is flat, usually in order to sleep or rest", "dic_examples": ["I'm going to lie down and take a short nap."], "clc": "Sometimes I want [to] relax and lie down on the bed to watch TV. ()"}]}}, "line": {"verb    [T]": {"line (sb/sth) up or line up (sb/sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to arrange people or things in a row or to stand in a row", "dic_examples": ["A fight broke out behind me as we lined up to receive our food rations.", "The soldiers lined us up against a wall and I thought they were going to shoot us."], "clc": "A lot of customers had lined up after me. ()"}], "line sb/sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to plan for something to happen", "dic_examples": ["What future projects have you lined up?"], "clc": "Nonetheless, we are also eager to help out in other projects that you have lined up. ()"}]}}, "listen": {"verb    [I]": {"listen in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to secretly listen to someone else's conversation", "dic_examples": ["Do you think he's been listening in on our conversations?"], "clc": "As John kept coming back late from work and giving the same kind of excuse, Maria decided to bug his phone at work as well as his workplace and then began to listen in on him. ()"}]}}, "live": {"verb": {"live for sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to have something or someone as the most important thing in your life", "dic_examples": ["She just lives for music."], "clc": "They are passionate, [and] live for their football team. ()"}], "live on sth": [{"gw": "MONEY", "gram": "", "is_phrase": false, "level": "B2", "definition": "If you live on an amount of money, that is the money that you use to buy the things that you need.", "dic_examples": ["We lived on very little when we first got married."], "clc": "They spent 2 years [there] and lived on their small salaries from several part-time jobs they had managed to get. ()"}, {"gw": "FOOD", "gram": "", "is_phrase": false, "level": "B2", "definition": "to only eat a particular type of food", "dic_examples": ["I more or less live on pasta."], "clc": "It may sound funny to live on \"carrots\", but as a matter of fact, veg[e]tarians do survive, so why shouldn't you? ()"}], "live through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to experience a difficult situation or event", "dic_examples": ["My grandparents lived through two world wars."], "clc": "Then you have never lived through a black out, those terrifying hours during which everything stops working including, as it seems, life itself. ()"}], "live together": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If two people live together, they share a home.", "dic_examples": ["Nowadays many young people live together."], "clc": "They [had] lived together for about 3 years but she [found out] he had been cheating [on] her and she didn't want to stay with him any more. ()"}], "live up to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be as good as someone hopes", "dic_examples": ["Did the trip live up to your expectations?"], "clc": "To my regret, the evening totally failed to live up to my expectations. ()"}], "live with sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to share a home with someone", "dic_examples": ["How do you like living with your parents?", "They live in a three-bedroom house with two other people."], "clc": "It will be nice to live with my sister again. ()"}]}}, "lock": {"verb": {"lock in sb or lock sb in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to prevent someone from leaving or prevent others from entering a room or building by locking a door", "dic_examples": ["She locked herself in her bedroom."], "clc": "My mother was about to die from her agony while my father was trying to find a way to lock me in. ()"}], "lock out sb or lock sb out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to prevent someone from entering a room or building by locking a door", "dic_examples": ["I can't believe I've locked myself out again!", "I forgot that my dad didn't have keys, and I locked him out of the house."], "clc": "In the very early morning, my husband and I heard a lot of noise at the front door and I went to see if Kate was locked out. ()"}]}}, "log": {"verb": {"log on/in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start using a computer or to connect a computer to a system of computers by typing a password and sometimes your name", "dic_examples": ["I tried to log on as usual but nothing happened."], "clc": "Well you need a computer and you have to log on [to] the Internet. ()"}], "log off/out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop using a computer or program or to stop a computer being connected to a computer system", "dic_examples": ["We were all asked to log off while some changes were made to the system."], "clc": "I know that most students just log off the computers, but they [are] still switch[ed] on and [use] energy. ()"}]}}, "look": {"verb": {"look after sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to take care of someone or something by keeping them healthy or in good condition", "dic_examples": ["We look after our neighbors' cat while they're away.", "If you look after your clothes they last a lot longer.", "Don't worry about Mia - she can look after herself."], "clc": "[They] didn't go with us because they had to look after their children. ()"}], "look ahead": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to think about what will happen in the future and plan for these events", "dic_examples": ["I'm looking ahead to next year and figuring out our staffing needs."], "clc": "One must always look ahead to the future and try to progress. ()"}], "look around (swh)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to visit a place and look at the things in it", "dic_examples": ["It's such a beautiful city, it's a shame we didn't have more time to look around."], "clc": "There are lots of museums in our city and you can enjoy looking around some of them. ()"}], "look at sth": [{"gw": "THINK", "gram": "", "is_phrase": false, "level": "B2", "definition": "to think about a subject carefully so that you can make a decision about it", "dic_examples": ["Management is looking at ways of cutting costs."], "clc": "I think we should look at this problem in a wider [way]. ()"}, {"gw": "READ", "gram": "", "is_phrase": false, "level": "B2", "definition": "to read something in order to check it or form an opinion about it", "dic_examples": ["Can you look at my essay sometime?"], "clc": "I was sitting in our coffee-room at school, looking at my homework while waiting for someone else to show up. ()"}, {"gw": "EXAMINE", "gram": "", "is_phrase": false, "level": "B2", "definition": "If someone, usually an expert, looks at something, they examine it.", "dic_examples": ["Did you get the doctor to look at your knee?"], "clc": "NONE (NONE)"}], "look back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to think about something that happened in the past", "dic_examples": ["Looking back, I can see where we went wrong.", "It wasn't such a bad experience when I look back on it."], "clc": "When I look back on the summer we spent together, I feel miserable and sometimes I burst into tears. ()"}], "look down on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to think that someone is less important than you", "dic_examples": ["I always felt she looked down on me because I wasn't as educated as she was."], "clc": "They never humiliate or look down on you just because you are a foreigner. ()"}], "look forward to sth/doing sth": [{"gw": "HAPPY", "gram": "", "is_phrase": false, "level": "B1", "definition": "to feel happy and excited about something that is going to happen", "dic_examples": ["I'm really looking forward to my vacation.", "She was looking forward to seeing the grandchildren again."], "clc": "I'm looking forward to seeing you soon. ()"}, {"gw": "LETTER", "gram": "", "is_phrase": false, "level": "B2", "definition": "used at the end of a formal letter to say you hope to hear from or see someone soon, or that you expect something from them", "dic_examples": ["I look forward to hearing from you."], "clc": "I look forward to hearing from you. ()"}], "look into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to examine the facts about a situation", "dic_examples": ["We're looking into the possibility of merging the two departments."], "clc": "Moreover, if we look into the matter in a conscious way, we can easily notice that we are leaving our forests and nature, in general, without any wild animals whatsoever. ()"}], "look on/upon sb/sth as sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to consider someone or something in a particular way", "dic_examples": ["We looked on her as a daughter.", "I've lived there so long I look on the town as my home."], "clc": "In some cases this can be looked upon as an asset. ()"}], "Look out!": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "something you say when someone is in danger", "dic_examples": ["Look out - there's a car coming!"], "clc": "\"Look out, it's very dangerous\". ()"}], "look  over sth or look sth over": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to examine something quickly", "dic_examples": ["I'm just looking over what you've written."], "clc": "I looked over the paper I had been given. ()"}], "look  through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to read something", "dic_examples": ["I've looked through a few catalogues.", "Make sure you look through your work to check for spelling mistakes."], "clc": "So I suggest you look through that magazine in order to find something else that interests you. ()"}], "look up sth or look sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to try to find a piece of information by looking in a book or on a computer", "dic_examples": ["If you don't know what the word means, look it up in a dictionary."], "clc": "If you have unfamiliar words, you can look up these words in [a] dictionary. ()"}], "look  up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to become better", "dic_examples": ["Our financial situation is looking up."], "clc": "The business is looking up and I have to cook m[any] more things. ()"}], "look up to sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to respect and admire someone", "dic_examples": ["She really looks up to her father."], "clc": "Nowadays people in Sweden and all over the world are looking up to Zlatan, and many young boys from his area in Sweden see him as a role model. ()"}]}}, "loosen": {"verb   [I or T]": {"loosen up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become more relaxed with other people", "dic_examples": ["After a while he loosened up."], "clc": "What is sure is that one needs to find something that will make him loosen up. ()"}]}}, "major": {"verb  [I]": {"major in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to study something as your main subject in college or a university", "dic_examples": ["She majored in earth sciences at Arizona State."], "clc": "I have majored in English for four years. ()"}]}}, "make": {"verb                                                   [T]": {"make for sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to move toward a place", "dic_examples": ["He got up and made for the exit."], "clc": "We might take a rest at the Frene Hotel and after having visited the Butterfly Farm, we will make for the Lakeside Inn. ()"}], "make sth into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to change something into something else", "dic_examples": ["They've made the spare room into an office."], "clc": "Sometimes people don't bother to read a book because it has been made into a film or a serie[s]. ()"}], "make of sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If you ask someone what they make of someone or something, you want to know their opinion about that person or thing.", "dic_examples": ["What do you make of this letter?", "I don't know what to make of him."], "clc": "At first we did not know what to make of it and we were all dumbfounded; but later we realized that it was none other [than] the Icelandic lady out there on our lawn. ()"}], "make out sth/sb or make sth/sb out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be able to see, hear or understand something or someone but with difficulty", "dic_examples": ["We could just make out a building through the trees.", "Could you make out what she was saying?"], "clc": "Somebody was standing outside, but she couldn't make out who [it] could be. ()"}], "make up sth or make sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to say or write something that is not true", "dic_examples": ["I made up an excuse about having to look after the kids.", "My dad was always really good at making up stories."], "clc": "Donald made up the best story. ()"}], "make up for sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to reduce the bad effect of something, or make something bad become something good", "dic_examples": ["No amount of money can make up for the death of a child.", "This year's good harvest will make up for last year's bad one.", "He bought me dinner to make up for being so late\n                             the day before."], "clc": "I really want to make up for the broken vase, but I am not sure if you will like my choice. ()"}]}}, "mess": {"verb": {"mess around": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to waste time playing and doing things with no particular purpose", "dic_examples": ["I was just messing around on the computer.", "Stop messing around and do your homework!"], "clc": "To add more, on Thursday there were so [many] children messing around that we couldn't supervise them, as we were only two people. ()"}], "mess around with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to interfere with or change something that doesn't need to be changed or that you don't want changed", "dic_examples": ["Has someone been messing around with the settings on my  computer again?"], "clc": "She can't help messing around with your house-keeping and your cooking. ()"}], "mess up sth or mess sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to spoil something, or to do something badly", "dic_examples": ["Don't try to cook lunch without me - you'll only mess it up. ", "I feel I've messed up my chances of getting the job."], "clc": "I ignored the price and just pa[i]d because I didn't want to mess up the evening. ()"}]}}, "miss": {"verb": {"miss out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to not do or have something that you would enjoy or something that other people do or have", "dic_examples": ["I got to the party too late and missed out on all the fun."], "clc": "They don't know what they are missing out on. ()"}]}}, "mix": {"verb": {"mix up sb/sth or mix sb/sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to confuse two people or things by thinking that one person or thing is the other person or thing", "dic_examples": ["People often mix up the sisters because they look so similar."], "clc": "My role was to arrange all the cables for the light and sound, and now we are talking cables of about the length of 100 m each. I'd really had a lot to do not to get them mixed up. ()"}]}}, "mount": {"verb": {"mount up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to gradually become a large amount", "dic_examples": [" My homework is really mounting up this week. "], "clc": "NONE (NONE)"}]}}, "move": {"verb": {"move in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to begin living in a new home", "dic_examples": ["She's just moved in with some friends."], "clc": "Well, when I just moved in, I didn't do anything, [except] put[ ]a new bed in my bedroom. ()"}], "move on": [{"gw": "NEW SUBJECT", "gram": "", "is_phrase": false, "level": "C1", "definition": "to change from one subject to another when you are talking or writing", "dic_examples": ["Let's move on to the next topic."], "clc": "Let's move on to the way of teaching and the subjects. ()"}, {"gw": "NEW ACTIVITY", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start doing a new activity", "dic_examples": ["I'd done the same job for ten years and felt it was time to move on."], "clc": "We have to wait for our turn to use one of the comput[e]rs, and tend to have a chat with the colleagues in the meanwhile instead of moving on to another thing. ()"}], "move out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to stop living in a particular home", "dic_examples": ["Her landlord has given her a week to move out."], "clc": "I need to move out and find somethin[g] near the Business Park area. ()"}]}}, "muddle": {"verb": {"muddle through": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to get something done even though you are not organized or prepared", "dic_examples": ["I don’t know how to keep score – I’ll just have to muddle through."], "clc": "NONE (NONE)"}]}}, "narrow": {"verb": {"narrow sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make something, for example a list or a choice, smaller and clearer by removing the things that are less important", "dic_examples": ["We've managed to narrow the list down to four."], "clc": "My hobbies were narrowed down to reading books, listening to some music and that's all. ()"}]}}, "note": {"verb   [T]": {"note down sth or note sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to write something so that you do not forget it", "dic_examples": ["I noted down their web address."], "clc": "There were [a] couple of things I noted down during the show. ()"}]}}, "open": {"verb": {"open up (sth) or open (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start a new store or business", "dic_examples": ["Several banks have recently opened up branches downtown.", "Fast food restaurants are opening up everywhere you look."], "clc": "We could set up hiking tours, mini-excursions in the mountains, survival camps. [...] With th[ese] kind[s] of activities, the village would need to open up more shops, restaurants, coffee shops etc. ()"}], "open up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to start to talk more about yourself and your feelings", "dic_examples": ["I've tried to get him to open up to me but without success."], "clc": "Even when I tried to open up to my best friend, he laughed at me and said that I should go to a psychiatr[ist]. ()"}]}}, "pack": {"verb   [I or T]": {"pack up (sth) or pack (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to collect all your things together when you have finished doing something", "dic_examples": ["Give me a  minute to pack up my things and then we can leave.", "I'm ready to pack up and head home.", "We need to pack everything up, but we can leave it here over the weekend."], "clc": "They packed up all the equipment [and got ready] to leave, because most of them had to attend school the next day. ()"}]}}, "pass": {"verb": {"pass around sth or pass sth around": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to offer something to each person in a group of people", "dic_examples": ["Would you pass the sandwiches around?"], "clc": "NONE (NONE)"}], "pass away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to die", "dic_examples": ["She passed away peacefully in her sleep."], "clc": "It was said his father was very ill and his doctor had said his father could pass away in a few months. ()"}], "pass on sth or pass sth on": [{"gw": "TELL", "gram": "", "is_phrase": false, "level": "B1", "definition": "to tell someone something that another person has told you", "dic_examples": ["Will you pass the message on to Edward?"], "clc": "Lucy asked me to pass on greetings to you. ()"}, {"gw": "GIVE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to give something to someone else", "dic_examples": ["Could you pass the book on to Lara when you finished with it?"], "clc": "NONE (NONE)"}], "pass out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become unconscious", "dic_examples": ["I passed out from the heat."], "clc": "When she felt a hand on her right shoulder, she passed out. ()"}]}}, "patch": {"verb   [T]": {"patch sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to try to improve your relationship with someone after you have had an argument", "dic_examples": [" Has he managed to patch things up with her? "], "clc": "Then in bed I asked my goddess to make my parents patch up their quarrel. ()"}]}}, "pay": {"verb": {"pay back sb/sth or pay sb/sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to pay someone the money that you owe them", "dic_examples": ["If you can buy the book for me, I'll pay you back tomorrow."], "clc": "I put money on the table. If it is not enough, please tell me [and] I'll pay you back. ()"}], "pay off sth or pay sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to pay all of the money that you owe", "dic_examples": ["I've paid off the loan."], "clc": "I promise you I'll pay off all my phone bills. ()"}], "pay off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If something that you have done to try to achieve something pays off, it is successful.", "dic_examples": ["All your hard work has obviously paid off!"], "clc": "I think people shouldn't underestimate the importance of books and I am sure it will finally pay off! ()"}]}}, "pick": {"verb        [T]": {"pick on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to choose a person and criticize or treat them unfairly", "dic_examples": ["The other boys pick on him because he's so small."], "clc": "They gave themselves names and acted as gangs rather than just groups of friends, and started picking on younger people, or mem[b]ers of other gang[s], trying to start fights with them. ()"}], "pick up sb/sth or pick sb/sth up": [{"gw": "LIFT", "gram": "", "is_phrase": false, "level": "A2", "definition": "to lift someone or something using your hands", "dic_examples": ["If the baby starts to cry, pick her up and rock her.", "I picked up the kids' clothes that were lying on the floor."], "clc": "I suddenly got an idea. I picked up a ball and kicked it. [T]he dog ran after it with the phone still in his mouth, [and] I followed him. ()"}, {"gw": "GET", "gram": "", "is_phrase": false, "level": "A2", "definition": "to get someone who is waiting for you, or to get something that you have left somewhere", "dic_examples": ["I have to pick the children up from school.", "When you're in town could you pick up the books I ordered?"], "clc": "I will pick you up and arrange everything. ()"}], "pick up sth or pick sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to learn a new skill or language by practicing it rather than being taught it", "dic_examples": ["When you live in a country you soon pick up the language."], "clc": "I am [a] very good swimmer and I know some basic sailing techniques which I picked up while I was in Canada. ()"}]}}, "pile": {"verb": {"pile up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If something unpleasant piles up, you get more and more of it.", "dic_examples": ["My work's really starting to pile up."], "clc": "My work [has] piled up and I have to carry on. ()"}]}}, "plug": {"verb": {"plug sth in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to connect a piece of electrical equipment to an electricity supply or to another piece of equipment", "dic_examples": ["Could you plug the iron in for me?"], "clc": "It allows anybody to call from anywhere without hav[ing] to plug it in a wall! ()"}]}}, "plunge": {"verb": {"plunge sth into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to push something very hard into something else", "dic_examples": ["He plunged the knife into the man's stomach."], "clc": "Eventually, they met again in Boston, and as Marco said, he felt as if somebody plunged a knife into his belly when he saw her after two years of separation. ()"}], "plunge into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to start doing something with a lot of energy", "dic_examples": ["Trying to forget about her, he plunged into his work."], "clc": "The solution for her is then to leave everything and plunge into a new life with her Indian lover. ()"}]}}, "point": {"verb": {"point out sth or point sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to tell someone about some information, often because they do not know it or have forgotten it", "dic_examples": ["He was planning a rock-climbing trip, till I pointed out that Carla is afraid of heights.", "I feel I should point out how dangerous it is."], "clc": "I would like to point out some incorrect information. ()"}]}}, "pose": {"verb": {"pose as sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to pretend that you are someone else", "dic_examples": [" He got into her house by posing as an electrician. "], "clc": "Roman, posing as his friend, even lends him some money, which of course Chen loses as well. ()"}]}}, "pour": {"phrasal verb": {"pour sth out or pour out sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If you pour out your feelings or thoughts, you talk very honestly about what is making you sad.", "dic_examples": ["She listened quietly while he poured out his troubles."], "clc": "She let me pour out my feelings, a thing I did not do to anyone. ()"}]}}, "provide": {"verb   [T]": {"provide for sth": [{"gw": "MAKE PLANS", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make plans in order to deal with a possible event in the future", "dic_examples": ["We must provide for depreciation when calculating the costs."], "clc": "It is difficult to tell what or who should provide for retired workers in the future. ()"}]}}, "pull": {"verb": {"pull down sth or pull sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to destroy a building", "dic_examples": ["They pulled down the warehouse to build a new supermarket."], "clc": "In addition to that, I'd do [my] very best to persuade the city council to arrange for the old, ugly houses to be pulled down as quickly as possible. ()"}], "pull in/into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a vehicle pulls in or pulls into somewhere, it moves in that direction and stops there.", "dic_examples": ["They just pulled into the driveway."], "clc": "He killed her and threw her body out of the train not far from the station, when the train [was] pulling in. ()"}], "pull out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a vehicle pulls out, it starts moving onto a road or onto a different part of the road.", "dic_examples": ["That car pulled out right in front of me."], "clc": "NONE (NONE)"}], "pull over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a vehicle pulls over, it moves to the side of the road and stops.", "dic_examples": ["I was looking for somewhere to pull over so I could look at the map."], "clc": "NONE (NONE)"}], "pull up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a vehicle pulls up, it stops, often for a short time.", "dic_examples": ["A car pulled up outside the bank and two men got out."], "clc": "I was walking home late one evening, when a car pulled up alongside me. ()"}]}}, "put": {"verb                                                [T]": {"put sth aside": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to save money for a particular purpose", "dic_examples": ["She puts aside $100 a month to save for vacation."], "clc": "Well, as soon as I got first major consulting contract - I started to put some money aside to buy my dream house - I managed a big down payment and rest was taken care of by the bank. ()"}, {"gw": "PROBLEM", "gram": "", "is_phrase": false, "level": "C2", "definition": "to ignore a problem or disagreement so that you can achieve something", "dic_examples": ["Putting aside practical difficulties, I think the proposal sounds really interesting."], "clc": "But I really wanted to do this for her, so I put my fears aside, and went on with the trip, which I hoped would be a\n                                 short one. ()"}], "put away sth or put sth away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to put something in the place or container where you usually keep it", "dic_examples": ["Put your toys away now."], "clc": "In the wardrobe there is no[t] enough room to put all my stuff away. ()"}], "put back sth or put sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to put something where it was before it was moved", "dic_examples": ["I put the book back on the shelf."], "clc": "I must have set [out] thousands [of] chairs correctly and after finishing I put them back nicely. ()"}], "put down sb/sth or put sb/sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to put someone or something that you are holding onto the floor or onto another surface", "dic_examples": ["I put my bags down while we talked.", "Put me down, Dad!"], "clc": "I lost something while I was out last week. I was at the airport and I [was] waiting for my luggage. I put my scarf\n                                 down and when my luggage arrived, I [left]. ()"}], "put down sth or put sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If you put the phone down, you put the part of the telephone that you speak into back to its usual position.", "dic_examples": ["It was only when I'd put the phone down that I realized what he'd said."], "clc": "\"I'll be there in a minute,\" answered Carla quickly and put the phone down. ()"}], "put down sb or put sb down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to write someone's name on a list or document, usually in order to arrange for them to do something", "dic_examples": ["I've put you down for the trip to Rome next week."], "clc": "NONE (NONE)"}], "put sth forward or put forward sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to state an idea or opinion, or to suggest a plan, so that it can be considered or discussed", "dic_examples": ["The government has put forward proposals to raise the drinking age."], "clc": "Secondly, we would like to put forward some ideas on how to improve your catering facilities. ()"}], "put off sth/doing sth or put sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to arrange to do something at a later time", "dic_examples": ["The meeting has been put off until the first week in June.", "I can't put off going to the dentist any longer."], "clc": "Finally, I would like to ask you if your offer is still available in September because it would be the most suitable time for us. Otherwise we would have to put off our other plans. ()"}], "put off sb or put sb off (sb/sth/doing sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make someone dislike something or someone, or to discourage someone from doing something", "dic_examples": ["I didn't enjoy the movie but don't let that put you off.", "I was put off by his aggressive attitude."], "clc": "As I told you I intended to go Paris, but the weather forecast was appalling enough to put me off. ()"}], "put on sth or put sth on": [{"gw": "CLOTHES", "gram": "", "is_phrase": false, "level": "A2", "definition": "to put clothes or shoes onto your body", "dic_examples": ["Put your coat on - it's cold outside."], "clc": "And I want you to put on some baggy clothes, so that you'll feel comfortable while working. ()"}, {"gw": "MAKEUP", "gram": "", "is_phrase": false, "level": "A2", "definition": "to put makeup or cream onto your skin", "dic_examples": ["Is there a mirror somewhere? I need to put my makeup on.", "Did you put on suntan lotion?"], "clc": "The girls go to buy a beautiful dress in Valencia, and cut their hair and put on some make up. ()"}, {"gw": "MUSIC/MOVIE", "gram": "", "is_phrase": false, "level": "A2", "definition": "to start a machine to play music, a movie, etc.", "dic_examples": ["Would you mind if I put some music on?"], "clc": "At the end we put on the music and we danced until 3 am. ()"}, {"gw": "WEIGHT", "gram": "", "is_phrase": false, "level": "B1", "definition": "If someone puts on weight, they become heavier.", "dic_examples": ["She put on about 10 pounds."], "clc": "I've put on weight. ()"}], "put out sth or put sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to make something that is burning stop burning", "dic_examples": ["They managed to put out the fire."], "clc": "The fire-engine came at last to put out the fire. ()"}], "put sb through": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to connect someone using a telephone to the person they want to speak to", "dic_examples": ["Can you put me through to customer service, please?"], "clc": "I call[ed] and I was put through [to] the manager, [who] told me that there were some problems and the tv man [hadn't]\n                                 been able to come. ()"}], "put sth together or put together sth": [{"gw": "JOIN PARTS", "gram": "", "is_phrase": false, "level": "B2", "definition": "to put the parts of something in the correct place and join them to each other", "dic_examples": ["You buy the bookcase in pieces and then put it together yourself."], "clc": "NONE (NONE)"}, {"gw": "PREPARE", "gram": "", "is_phrase": false, "level": "C1", "definition": "to prepare a piece of work by collecting several ideas and suggestions and organizing them", "dic_examples": ["to put together a plan/proposal"], "clc": "We have put together here a few good points in order to make your money last a little bit longer. ()"}], "put up sth or put sth up": [{"gw": "RAISE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to raise something, or to fix something in a raised position", "dic_examples": ["I put my hand up to ask the teacher a question.", "They've put a few pictures up on the wall."], "clc": "If you want to order some food, you just need to put your hand up and they will come to serve you immediately. ()"}, {"gw": "SPREAD", "gram": "", "is_phrase": false, "level": "B1", "definition": "to spread something that is folded or rolled up, such as a tent, umbrella, etc. so that it is ready to be used", "dic_examples": ["We put the tent up near a river.", "I'll put my umbrella up."], "clc": "We drove the [w]hole day and in the evening we put up a tent and slept. ()"}, {"gw": "BUILD", "gram": "", "is_phrase": false, "level": "B2", "definition": "to build something", "dic_examples": ["They're planning to put a hotel up where the museum used to be.", "We're going to put up a new fence around our garden."], "clc": "Therefore I suggest [you] put up a small wall between the café and the ticket office. ()"}], "put up sb or put sb up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to let someone stay in your home for a short period", "dic_examples": ["If you need somewhere to stay we can put you up for the night."], "clc": "We'll put all of you up with pleasure! ()"}], "put up with sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to accept unpleasant behavior or an unpleasant situation, although you do not like it", "dic_examples": ["I can put up with the house being messy, but I hate it if it's not clean.", "He's so rude - I don't know how she puts up with him."], "clc": "You can do anything you want sitting comfortabl[y] in your house with your computer instead of going out and putting\n                                 up with traffic jams, bad weather or rude people. ()"}]}}, "read": {"verb      [I or T]": {"read out sth or read sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to read something and say the words aloud so that other people can hear", "dic_examples": ["He read out the names of all the winners."], "clc": "Michael sat in his fav[or]ite chair while his wife read out what had happened. ()"}], "read over/through sth or read sth over/through": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to read something from the beginning to the end, especially to find mistakes", "dic_examples": ["I read over my essay to check for errors."], "clc": "I thought my eyes were deceiving me [so] I read the letter over again. ()"}]}}, "reconcile": {"verb   [T]": {"reconcile yourself to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to accept a situation although you do not like it", "dic_examples": ["Eventually he reconciled himself to living without her."], "clc": "I couldn't reconcile myself to the thought that my sister had proved to be smarter than me once again. ()"}]}}, "reduce": {"verb    [T]": {"reduce sb to sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make someone unhappy or cause them to be in a bad situation", "dic_examples": ["She was reduced to tears by his comments.", "I lost my job and was reduced to borrowing money from friends."], "clc": "She was also very hard with stubborn witnesses, reducing them to tears, or pumping them dry of information where necessary. ()"}], "reduce sth to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to destroy something, especially something that has been built", "dic_examples": ["The earthquake reduced the city to rubble."], "clc": "NONE (NONE)"}]}}, "refer": {"verb": {"refer to sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to talk or write about someone or something, especially briefly", "dic_examples": ["I don’t know which of his sisters he was referring to.", "He always referred to his father as \"the old man.\""], "clc": "In your book you refer to the Hotel Astrid but they  decided to close it last year. ()"}]}}, "relate": {"verb": {"relate to sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to be connected to, or to be about someone or something", "dic_examples": ["Please provide all information relating to the claim."], "clc": "And, finally, relating to your concern about the costs of the changes, we think that opening the Centre to the public would surely provide the required funds without having to impose a fee on the students, which would probably result in a radical decrease of their use of the facilities. ()"}], "relate to sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to understand how someone feels", "dic_examples": ["Most teenagers find it hard to relate to their parents."], "clc": "A soap opera should always be dramatic and not produced too \"polished\" or \"clean\" because then people would see it more as a movie, and people never relate as much to a character in a movie as they do to a character played by a good, down-to-earth actor who is apparently struggling as much as everybody [else]. ()"}]}}, "relieve": {"verb   [T]": {"relieve sb of sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to take something away from someone", "dic_examples": [" Let me relieve you of your luggage. "], "clc": "There is nothing they can do on the outside now and they are relieved of their responsibilities. ()"}]}}, "rely": {"verb": {"rely on sb/sth": [{"gw": "NEED", "gram": "", "is_phrase": false, "level": "B2", "definition": "to need someone or something in order to be successful, work correctly, etc.", "dic_examples": ["The system relies too heavily on one person.", "The success of this project relies on everyone making an effort."], "clc": "Another thing is that [people] rely on modern medicine more and more. ()"}, {"gw": "TRUST", "gram": "", "is_phrase": false, "level": "B2", "definition": "to trust someone or something", "dic_examples": ["I know I can rely on you to help me.", "You can’t rely on good weather for the whole trip."], "clc": "People rely on me as I always keep m[y] promises. ()"}]}}, "remind": {"verb   [T]": {"remind sb of sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to be similar to, or make you think of, something or someone else", "dic_examples": ["She reminds me of Elaine.", "Her laugh reminds me of Cory."], "clc": "It's not an expensive scarf, but I like it bec[a]use it reminds me of my sister; she gave me this scarf for my birthday some years ago. ()"}]}}, "resign": {"verb   [I or T]": {"resign yourself to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make yourself accept something that you do not like because you cannot easily change it", "dic_examples": ["He resigned himself to living alone."], "clc": "Personally I wouldn't like to be at the age when you can't afford anything except bread and butter and you have to resign yourself to this miserable existence without any hope for [a] brighter future. ()"}]}}, "resort": {"phrasal verb": {"resort to sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to do something in order to achieve what you want, because it is the only thing you can do to achieve it", "dic_examples": ["I had to resort to threats to get my money back."], "clc": "This is caused by a person's basic need for food: If someone can't get enough to eat he might have to resort to stealing. ()"}]}}, "result": {"verb": {"result in sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to cause a particular situation to happen", "dic_examples": ["The fire resulted in damage to their property."], "clc": "It has resulted in a lack of repair services. ()"}]}}, "revert": {"verb": {"revert to sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to go back to how something was before", "dic_examples": ["For a while I ate low-fat food but then I reverted to my old eating habits."], "clc": "Piggy is one of the few boys who are conscious that they are reverting to savagery. ()"}]}}, "rip": {"verb    [I or T]": {"rip sb off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to cheat someone by making them pay too much money for something", "dic_examples": ["We got ripped off when we bought our car."], "clc": "Although I prefer wedding ceremonies the traditional way, I do feel that it's also a big market where brides-to-be get ripped off by the ridiculous prices of wedding gowns, venues and photographers. ()"}]}}, "rule": {"verb": {"rule out sb/sth or rule sb/sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to decide or state that something is impossible or will not happen, or that something or someone is not suitable", "dic_examples": ["It’s unlikely that he’ll run for president, but you can never rule anything out.", "The police have not ruled him out as a suspect."], "clc": "Owning a house no longer seems to be a practical future plan and has to be ruled out, which meant that people lost their ultimate goal for working. ()"}]}}, "run": {"verb": {"run around": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to be very busy doing a lot of different things", "dic_examples": ["I'm exhausted, I've been running around all morning."], "clc": "Nowadays people are running around trying to save time wherever they can, when in reality time passes far quicker when we try to save it. ()"}], "run away": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to secretly leave a place because you are unhappy there", "dic_examples": ["She ran away from home at the age of 13."], "clc": "At the age of fourteen, she ran away from home. ()"}], "run  down sb/sth or run sb/sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to criticize someone or something, often unfairly", "dic_examples": ["Whatever the government do, the press will always run them down."], "clc": "But it's not fair to run down my country's past achievements. ()"}], "run  into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to accidentally hit something while you are driving a vehicle", "dic_examples": ["He lost control of the car and ran into a tree."], "clc": "I had tried to stop my car next to the road but I ran into a signpost. ()"}], "run  into sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to meet someone that you know when you did not expect to meet them", "dic_examples": ["I ran into Harry on the train."], "clc": "We ran into an old friend of mine and we decided to have a coffee together. ()"}], "run on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "If a machine runs on a supply of power, it uses that power to work.", "dic_examples": ["My laptop is running on battery power."], "clc": "Public transport will be quick and free, and run on electric power, so there won't be car pollution. ()"}], "run out": [{"gw": "USE ALL", "gram": "", "is_phrase": false, "level": "B1", "definition": "to finish, use or sell all of something, so that there is none left", "dic_examples": ["I've run out of money/ideas/patience.", "\"Have you got any milk?\"  \"Sorry, I ran out.\""], "clc": "Well, I have run out of time, so I have to stop writing. ()"}, {"gw": "ALL USED", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a supply of something runs out, all of it has been used or it is completely finished.", "dic_examples": ["We've  run out of milk.", "My patience is beginning to run out."], "clc": "In addition, if you are at home and something you need has run out or broken, you can go to buy it at any time. ()"}], "run over sb/sth or run sb/sth over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to hit someone or something with a vehicle and drive over them, injuring or killing them", "dic_examples": ["He was run over by a bus."], "clc": "After a while, his father vanished and a car ran over John and killed him. ()"}], "run through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to repeat something in order to practice it or to make sure that it is correct", "dic_examples": ["I just need to run through my talk."], "clc": "NONE (NONE)"}], "run up against sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If you run up against problems or difficulties, you begin to experience them.", "dic_examples": ["The plan for the park ran up against strong local opposition."], "clc": "After running up against a lot of difficulties we managed to reach our hotel. ()"}]}}, "rush": {"verb": {"rush into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start doing something without thinking about it enough first", "dic_examples": ["I rushed into marriage when I was much too young."], "clc": "I also have bad sides which are that I'm stubborn sometimes and rush into things. ()"}]}}, "saddle": {"verb": {"saddle sb with sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to give someone a job or problem which will cause them a lot of work or difficulty", "dic_examples": ["We're saddled with a lot of debt."], "clc": "People go on shopping sprees and are then saddled with huge credit card bills. ()"}]}}, "scare": {"verb     [T]": {"scare sb/sth away/off or scare away/off sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to make a person or an animal so frightened that they go away", "dic_examples": ["She scared off her attacker by screaming."], "clc": "For example, in the Ionian Islands, people break pots on Friday night in order to scare away evil spirits. ()"}], "scare sb away/off or scare away/off sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to make someone worried about doing something or going somewhere so that they decide not to do it or go there", "dic_examples": ["The recent bomb attacks have scared away the tourists."], "clc": "During the dance display and horse show we actually did experience some rainfall, however it was a small shower and it didn't manage to scare off the people and to prevent the organi[z]ers from reaching their main goal. ()"}]}}, "seal": {"verb": {"seal off sth or seal sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to prevent people from entering an area or building, often because it is dangerous", "dic_examples": ["Police immediately sealed off the streets."], "clc": "The police sealed off the main street a few weeks ago because they have been building a new restaurant. ()"}]}}, "see": {"verb": {"see off sb or\n                see sb off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to go to the place that someone is leaving from in order to say goodbye", "dic_examples": ["They came to see me off at the airport."], "clc": "She came to the station to see him off. ()"}], "see through sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to understand that someone is trying to deceive you", "dic_examples": ["It didn't take long for us to see through his charm."], "clc": "NONE (NONE)"}], "see to sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to deal with a person or task that needs to be dealt with", "dic_examples": ["\"These letters need to be mailed.\" \"I'll see to them later.\"", "Please see to it\n                             that no one comes in without identification."], "clc": "If you want to keep an animal happy and healthy, it is also important, in my opinion, to see to it that, for instance, the monkeys have real trees to climb in! ()"}]}}, "sell": {"verb": {"sell out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a supply of something sells out, or if it is sold out, there is no more of that thing to buy.", "dic_examples": ["The first issue of the magazine sold out within two days."], "clc": "All the tickets were sold out and the stadium was nearly full. ()"}]}}, "send": {"verb         [T]": {"send sth back or send back sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to return something to the person who sent it to you, especially because it is damaged or not suitable", "dic_examples": ["I had to send the shirt back because it didn't fit me."], "clc": "I usual[l]y order my clothes [on the] Internet.  It's fast, easy and you don't have any problems send[ing] them back if they don't fit. ()"}], "send for sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to send someone a message asking them to come to see you", "dic_examples": ["We had to send for a doctor."], "clc": "Immediately after his arrival he sent for Beadle. ()"}], "send off sth or\n                send sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to send a letter, document or parcel by mail", "dic_examples": ["Have you sent off your application yet?"], "clc": "NONE (NONE)"}], "send sth out or send out sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to produce something in a way that causes it to spread out from a central point", "dic_examples": ["The laser sends out a red beam of light.", " The bushes were sending out new shoots.", "The smoke alarm sent out a high-pitched sound."], "clc": "On the other side of the lake the placid grazing cows would munch their breakfast as the sun rose on the horizon, sending out a flood of colors across the sky. ()"}]}}, "set": {"verb": {"set sth aside or set aside sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to save something, usually money, for a particular purpose", "dic_examples": ["She sets aside $100 every month to save for vacation."], "clc": "You never know when you'll need extra money, so it'll be important for you to set some aside. ()"}], "set back sb/sth or set sb/sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to make something happen more slowly or later than it should", "dic_examples": ["These delays have set back the publication date by a month.", "Another failed harvest would really set these farmers back."], "clc": "She would put off school which set her back a couple of years but she was free to choose and do what she really enjoyed do[ing]. ()"}], "set off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to start a journey", "dic_examples": ["What time do we have to set off for the airport tomorrow?", "They just set off on an around-the-world cruise."], "clc": "We set off [for] home at 5 o'clock. ()"}], "set off sth or set sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to cause something to begin or happen, especially a loud noise or a lot of activity", "dic_examples": ["The spark set off a loud explosion.", "The announcement set off a wave of protest."], "clc": "He would set off the smoke alarm by lighting some of his matches. ()"}], "set out": [{"gw": "TRIP", "gram": "", "is_phrase": false, "level": "B1", "definition": "to begin a trip", "dic_examples": ["Martin set out on his bike ride before dawn.", "When do you want to set out?"], "clc": "Next morning I packed my luggage and set out on our trip to France. ()"}, {"gw": "AIM", "gram": "", "is_phrase": false, "level": "C2", "definition": "to start an activity with a particular aim", "dic_examples": ["She set out with the aim of becoming the youngest ever winner of the championship.", "They set out to discover a cure for cancer."], "clc": "That is why the day her son was named emperor a smile of satisfaction played round her lips, because at last she had achieved what she had set out to do, which was make her son ascend the throne. ()"}], "set out sth or set sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to give all the details of something, or to explain something clearly, especially in writing", "dic_examples": ["All the project costs are set out in this proposal.", "She gave a presentation setting out the company's future plans."], "clc": "I'm writing this composition to set out the main statements in favor of the idea that more help is needed to protect the enviro[n]ment. ()"}], "set up sth or set sth up": [{"gw": "ORGANIZATION", "gram": "", "is_phrase": false, "level": "B1", "definition": "to formally establish a new company, organization, system, way of working, etc.", "dic_examples": ["A committee has been set up to organize the club's social events.", "She plans to set up her own business.", "They've set up a fund for victims of the earthquake."], "clc": "It is such a beautiful country that I wanted to stay there and set up a business. ()"}, {"gw": "EVENT/ACTIVITY", "gram": "", "is_phrase": false, "level": "B2", "definition": "to arrange for an event or activity to happen", "dic_examples": ["We need to set up a meeting to discuss the proposals.", "The city council has agreed to set up a public review."], "clc": "I suggest we try to set up a meeting with people from city hall, and give them all the right arguments. ()"}]}}, "settle": {"verb": {"settle down": [{"gw": "FEEL COMFORTABLE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become familiar with a place and to feel happy and confident in it", "dic_examples": ["She quickly settled down in her new house/job/school."], "clc": "He seemed to be such a nice guy and I was very happy to find you [have] settled down so well in your new life. ()"}, {"gw": "MAKE HOME", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start living in a place where you intend to stay for a long time", "dic_examples": ["Eventually I'd like to settle down and have a family, but not yet."], "clc": "I guess the changes occur once the young couple decides to marry and settle down. ()"}], "settle (sb) down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become quiet and calm, or to make someone quiet and calm", "dic_examples": ["They settled down on the sofa to watch the movie.", "Come on class, stop talking and settle down, please!"], "clc": "You should welcome your relatives, make them settle down and ask them to wait a moment. ()"}], "settle in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to begin to feel relaxed and happy in a new home or job", "dic_examples": ["Are you settling in OK?"], "clc": "After you settle in, you'll find there's a lot of way[s] to save money on food. ()"}]}}, "shake": {"verb": {"shake off sth or shake sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to get rid of an illness, something unpleasant, or something that is causing you problems", "dic_examples": ["I hope I can shake off this cold before the weekend."], "clc": "He was capable of shaking off the criticism due to the fact that he believed strongly enough in himself, which I find quite remarkable. ()"}], "shake up sth or shake sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to cause large changes in something", "dic_examples": ["Technological changes have shaken up many industries."], "clc": "I believe that their aim is to shake up public opinion in the most impressive way they can. ()"}], "shake up sb or shake sb up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If an unpleasant experience shakes someone up, it makes them feel shocked and upset.", "dic_examples": ["The accident really shook him up."], "clc": "NONE (NONE)"}]}}, "show": {"verb": {"show sb around": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to go with someone and show them a place", "dic_examples": ["Alejandro offered to show her around Mexico City."], "clc": "I can take a few day[s] off work and show you around the city. ()"}], "show off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to try to make people admire your abilities or achievements in a way which other people find annoying", "dic_examples": ["She only bought that sports car to show off and prove she could afford one.", "He's always showing off to his classmates."], "clc": "You can even show off a bit to your relatives and friends. ()"}], "show up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to arrive somewhere", "dic_examples": ["I invited him for eight o'clock, but he didn't show up until nine-thirty.", "We were expecting thirty people to come, but half of them never showed up."], "clc": "I took him to his father and then my friend, Maria, showed up. ()"}]}}, "shut": {"verb     [I or T]": {"shut (sth) down or shut down (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If a computer or machine shuts down or someone shuts it down, it stops operating.", "dic_examples": ["Make sure you shut down your computer before you leave.", "The crew shut down one of the four engines on the plane."], "clc": "I was as happy as a lark. I shut down the computer and I called my mom to tell her about the good news. ()"}, {"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a business or organization shuts down or someone shuts it down, it closes.", "dic_examples": ["The company plans to shut down four assembly plants and cut 10,000 jobs."], "clc": "A great [number] of zoos ought to be shut down. ()"}], "shut (sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop talking or making a noise, or to make someone do this", "dic_examples": ["I wish you'd shut up for a minute and listen to what the rest of us have to say.", "Please just shut up! I’m trying to think.", "My dad never stops talking. It's impossible to shut him up!"], "clc": "You must still remember that time we walked along the street, singing blues and rock, it's incredible the way that people shouted at us to shut up. ()"}]}}, "sign": {"verb   [I or T]": {"sign up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to arrange to take part in an organized activity", "dic_examples": ["I've signed up for evening classes at the community college."], "clc": "If you are interested in other activities, just sign up for them [on] the notice board. ()"}]}}, "sketch": {"verb  [T]": {"sketch sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to give a short description with few details, especially of an idea or plan", "dic_examples": [" I've sketched out some ideas for my new book. "], "clc": "The way I would bring up my own children, right now I'm not too sure if I'm ever going to have one or even more, wouldn't differ a great deal from the way I sketched out at the beginning. ()"}]}}, "sleep": {"verb     [I]": {"sleep with sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to have sex with someone", "dic_examples": ["She accused him of sleeping with her friend."], "clc": "Liza dreams of becoming a \"real actress\" and plays a very naive character who is willing to sleep with anyone who might lead her to success. ()"}]}}, "slip": {"verb": {"slip away": [{"gw": "DISAPPEAR", "gram": "", "is_phrase": false, "level": "C2", "definition": "If someone's power or the possibility of them winning or achieving something slips away, it disappears.", "dic_examples": ["Down to ten men, the team was determined not to let victory slip away. "], "clc": "I immediately saw my dream slip away. ()"}, {"gw": "LEAVE", "gram": "", "is_phrase": false, "level": "C2", "definition": "to leave secretly", "dic_examples": ["He slipped away from the party as soon as he could."], "clc": "However, my mother sometimes behaved like a hen looking out for her little ones for fear one of us could slip away. ()"}, {"gw": "DIE", "gram": "", "is_phrase": false, "level": "C2", "definition": "If someone slips away, they die.", "dic_examples": ["Despite their care, he slipped away in the night."], "clc": "This can sometimes ease the burden of watching someone you love slip away. ()"}, {"gw": "TIME", "gram": "", "is_phrase": false, "level": "C2", "definition": "If a period of time slips away, it seems to pass quickly.", "dic_examples": ["As the months slipped away, I began to forget what he looked like."], "clc": "They are pressed to make money and their major concern seems to be the time that always slips away. ()"}], "slip out": [{"gw": "SAY SOMETHING", "gram": "", "is_phrase": false, "level": "C2", "definition": "If a remark slips out, you say it without intending to.", "dic_examples": ["I didn't mean to tell anyone you were getting married - it just slipped out."], "clc": "I could not understand how these words had slipped out of my mouth. ()"}], "slip up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make a mistake", "dic_examples": ["These figures don't make sense - have we slipped up somewhere?"], "clc": "NONE (NONE)"}]}}, "slow": {"verb    [I or T]": {"slow (sb/sth) down or slow down (sb/sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to become slower, or to make someone or something become slower", "dic_examples": ["Slow down, you two, you're walking too fast!", "If I run with Christina she tends to slow me down."], "clc": "Suddenly a car slowed down not far from him. ()"}], "slow down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If someone slows down, they become less active.", "dic_examples": ["The doctor told me I should slow down and not work so hard."], "clc": "I just can't understand why you don't slow down a bit. Have a bit [of] fun, enjoy life! ()"}]}}, "soak": {"phrasal verb": {"soak up sth or soak sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to enjoy the effects of an experience", "dic_examples": ["We arrived early at the festival to soak up the atmosphere.", "I spent two weeks in Greece soaking up the sun."], "clc": "I like a lazy rest, so I took advantage of [the] sunny weather and sandy beach and soaked up the sun all day long. ()"}]}}, "sort": {"verb    [T]": {"sort out sth or sort sth out": [{"gw": "SOLVE PROBLEM", "gram": "", "is_phrase": false, "level": "B2", "definition": "to successfully deal with something, such as a problem or difficult situation", "dic_examples": ["Did you get your schedule sorted out yet?", "There are a few things I need to sort out at work."], "clc": "The reason why I can't do that late in the evening is that they need the car themselves then, to sort out some last things before the wedding. ()"}, {"gw": "ORGANIZE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to organize or arrange things that  are not neat", "dic_examples": ["I need to  sort out my closet."], "clc": "To keep myself busy I started to sort out the files on my desk. ()"}]}}, "speak": {"verb": {"speak up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to speak in a louder voice so that people can hear you", "dic_examples": ["Could you speak up? We can't hear at the back."], "clc": "First of all, I read it far too fast and in a voice that was hardly a[udi]ble, and people started to shout that they couldn't hear me and that I should speak up; it was terrible! ()"}]}}, "spin": {"verb   [I or T]": {"spin (sb) around": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "If you spin around, or someone spins you around, your body turns quickly to face the opposite direction.", "dic_examples": ["She spun around to see what had happened."], "clc": "She felt this pleasant drift immediately and spun around, being afraid that she would see someone at the doorway. ()"}]}}, "split": {"verb": {"split up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "If two people who are married or have a relationship split up, they end it.", "dic_examples": ["They've split up."], "clc": "I asked her about the family and about her. She had recently split up with her boyfriend, Joe. ()"}]}}, "spread": {"verb": {"spread out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If people spread out, they move from being close together in a group to being in different places across a larger area.", "dic_examples": ["They spread out to search the whole area."], "clc": "They don't dare to spread out in the space. ()"}]}}, "spring": {"verb": {"spring from sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to come from or be the result of something", "dic_examples": ["Her remarkable poise springs from her early theater training."], "clc": "Here again, the musicians are concentrated on the energy and beauty of their surroundings and their lyrics spring from everyday observations, thus greatly enhancing the potential of small things. ()"}], "spring up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to appear suddenly", "dic_examples": ["A lot of new hotels have sprung up along the coast recently."], "clc": "A number of new budget airlines have sprung up in Europe [over] the last several years. ()"}]}}, "spy": {"verb": {"spy on sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to secretly watch someone", "dic_examples": ["He spied on her through the keyhole."], "clc": "Edmund starts spying on Charles to find out which his weaknesses are. ()"}]}}, "squeeze": {"verb     [T]": {"squeeze (sb/sth) in/squeeze (sb/sth) into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to succeed in getting someone or something into a small space or object, often by pushing or forcing", "dic_examples": ["We have four people in our car, but we could squeeze one more person in the back.", "I must have put on some weight - I can only just squeeze into my jeans."], "clc": "At the end of the day, I would not only be carrying [a] pile of shopping bags but also trying to squeeze in between other passengers on the train on my way home. ()"}], "squeeze sb/sth in or squeeze in sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to manage to do something or see someone in a short period of time or when you are very busy", "dic_examples": ["While we're in Australia, we're hoping to squeeze in a trip to the Barrier Reef.", "I'm very busy this week but I could squeeze you in at 2:30 on Tuesday."], "clc": "Besides, the acquisition of two more TV sets and video cassette players would be extremely desirable as at the moment we have great difficulty in squeezing in video lesson[s] in the timetable having only one video class[room] available. ()"}]}}, "stand": {"verb": {"stand back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to move a short distance away from something or someone", "dic_examples": ["Please stand back - then all of you will be able to see what I'm doing."], "clc": "NONE (NONE)"}], "stand by sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to support or be loyal to someone", "dic_examples": ["The boy’s friends stood by him, firmly convinced of his innocence."], "clc": "And I promise I'll stand by you. ()"}], "stand for sth": [{"gw": "REPRESENT", "gram": "", "is_phrase": false, "level": "B2", "definition": "to support or represent a particular idea or set of ideas", "dic_examples": ["This party stands for low taxes and individual freedom."], "clc": "She said she would stand her ground, and never, never stagger. ()"}, {"gw": "LETTERS", "gram": "", "is_phrase": false, "level": "B2", "definition": "If one or more letters stand for a word or name, they are the first letter or letters of that word or name and they represent it", "dic_examples": ["\"GMT\" stands for Greenwich Mean Time."], "clc": "NONE (NONE)"}, {"gw": "ACCEPT", "gram": "", "is_phrase": false, "level": "C2", "definition": "used with \"not\" to say you will not accept a situation or a particular type of behavior", "dic_examples": ["Maybe you think his behavior is OK, but I won’t stand for it."], "clc": "Much as I admire the performance of the new aircraft today, I understand your need to fly and test new technologies, but I will not stand for it any longer. ()"}], "stand in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to do something that someone else was going to do because they cannot be there", "dic_examples": ["She stood in for me when I was sick."], "clc": "As I will be away these two days, I have asked Mr. Ryman's secretary Sandy, to stand in for me. ()"}], "stand out": [{"gw": "BE BETTER", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be much better than other similar things or people", "dic_examples": ["One candidate stood out from the rest."], "clc": "Those small fishing villages will always stand out in my memory. ()"}, {"gw": "EASY TO SEE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be easy to see or notice", "dic_examples": ["The bright blue letters really stand out on the page."], "clc": "Why wasn't that money spent in trying to make them more bearable to [look at], [rather] than making them stand out even more? ()"}], "stand up sb or stand sb up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to fail to meet someone you have arranged to see", "dic_examples": ["I was starting to think I'd been stood up when he finally arrived."], "clc": "NONE (NONE)"}], "stand up for sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to defend or support a particular idea or a person who is being criticized or attacked", "dic_examples": ["It's high time we all stood up for our rights around here.", "Don't be bullied, learn to stand up for yourself and what you believe in."], "clc": "He decides to stand up for black rights and becomes an important leader. ()"}], "stand up to sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to defend yourself against a powerful person or organization when they treat you unfairly", "dic_examples": ["He wasn't afraid to stand up to bullies."], "clc": "They say that the best things in life are for free, courage, hope, love for freedom and the power to stand up to others, defending one's own rights. ()"}]}}, "start": {"verb        [I or T]": {"start (sth) off or start off(sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to begin by doing something, or to make something begin by doing something", "dic_examples": ["She started off the meeting with the monthly sales report.", "I'd like to start off by thanking you all for coming today."], "clc": "We started off the trip by driving to the foot of the mountain, where there was a village. ()"}], "start out": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to begin your life, or the part of your life when you work, in a particular way", "dic_examples": ["My dad started out as a sales assistant in a department store."], "clc": "She is a beautiful, talented wom[a]n who started out as a small actress in her own country, climbing up to become the fully-recognized celebrity that she is now. ()"}]}}, "stay": {"verb            [I]": {"stay away (from sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to remain away from something or to avoid something", "dic_examples": ["Stay away from the edge of the cliff.", "Those buildings are being torn down - you should stay away."], "clc": "The place is small and with a lot of trees if you prefer to stay away from the hot summer sun or if you feel like having a picnic. ()"}], "stay behind": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to remain at a place when other people leave it", "dic_examples": ["Francine went on ahead and I stayed behind to wait for Annie."], "clc": "The tourists were to stay behind, waiting for his return, so they all made themselves comfortable as well as they could. ()"}], "stay on": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to remain somewhere for a longer time than expected or after other people have left", "dic_examples": ["His boss asked him to stay on as manager for another year."], "clc": "Thus it can be seen in the novel that Olivia left her husband for another man and that she was determined to stay on in India in spite of her friends judging her. ()"}], "stay out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to not come home at night, or to go home late", "dic_examples": ["My folks don't let me stay out late."], "clc": "Firstly, I like it so much because we have no school and we can stay out for as long as we want. ()"}], "stay out of sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to not become involved in an argument or discussion", "dic_examples": ["It's better to stay out of their arguments.", "You don't know anything about this, so just stay out of it!"], "clc": "NONE (NONE)"}], "stay over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to spend the night somewhere instead of returning to your home or continuing your journey", "dic_examples": ["Why don't you stay over and drive back in the morning?"], "clc": "We stay[ed] over in a hotel and the next morning Tom brought me home. ()"}], "stay up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to go to bed later than usual", "dic_examples": ["We stayed up (late) to watch a movie on TV."], "clc": "In Vegas, we were staying up all night gambling. ()"}]}}, "stem": {"verb  [T]": {"stem from sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to develop as the result of something", "dic_examples": ["Her problems stem from childhood."], "clc": "This educational approach stems from strong family values and religious beliefs. ()"}]}}, "step": {"verb": {"step down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to leave an important job", "dic_examples": ["She stepped down as captain of the swim team."], "clc": "Thus, he decided to retire, to step down from the tough and competitive environment and planned for the rest of his life. ()"}]}}, "stick": {"verb": {"stick by sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to continue to support someone when they are having problems", "dic_examples": ["I'll stick by you whatever happens.", "She was determined to stick by her family."], "clc": "NONE (NONE)"}], "stick out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to go past the surface or edge of something", "dic_examples": ["Ryan's ears stick out a little, don't they!", "There was a handkerchief sticking out of his jacket pocket."], "clc": "The seat was damaged and something was sticking out. ()"}], "stick to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to limit yourself to doing or using one particular thing and not change to anything else", "dic_examples": ["Could you stick to the point, please?", "Stick to the trail - you don't want to get lost.", "I have trouble sticking to a budget."], "clc": "I'll stick to baggy t-shirts, jeans, baseball caps and [sneak]ers. ()"}], "stick together": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If people stick together, they support and help each other.", "dic_examples": ["If we all stick together, we can succeed."], "clc": "Who would ever have thoug[h]t that the little school band from the good old days would get so far? It must be at least 20 years since we left school, and I haven't seen any of the good old school mates for more than 10 [years], but they must have stuck together. ()"}], "stick up for sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to support someone or something when they are being criticized", "dic_examples": ["I feel I have to stick up for him."], "clc": "Two brothers Lev and Dmitri used to stick up for each other at school and could never be beaten at any physical sport because they were extremely strong. ()"}], "stick with sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to continue doing something or using someone to do work for you, and not stopping or changing to something or someone else", "dic_examples": ["He said that he was going to stick with the traditions established by his grandfather.", "He's a good car mechanic - I think we should stick with him."], "clc": "[O]n Monday [the] 13 and Wednesday [the] 14 of March, we still stick with your plan. ()"}]}}, "stir": {"verb": {"stir up sth or stir sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to cause arguments or bad feeling between people, usually on purpose", "dic_examples": ["I think he just likes to stir up trouble."], "clc": "She had a rough childhood and was constantly stirring up trouble. ()"}]}}, "stop": {"verb": {"stop over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to stop somewhere for a short period of time when you are on a long journey", "dic_examples": ["We stopped over in Los Angeles for two nights on the way to New Zealand."], "clc": "NONE (NONE)"}]}}, "store": {"verb     [T]": {"store up sth": [{"gw": "REMEMBER", "gram": "", "is_phrase": false, "level": "C1", "definition": "to remember things, usually so that you can tell people about them later", "dic_examples": ["I've been listening to their conversations and storing it all up for future use."], "clc": "Although I like people I often make fun of them or tell one of the many jokes stored up in my hopelessly overloade[d] brain. ()"}, {"gw": "KEEP", "gram": "", "is_phrase": false, "level": "C2", "definition": "to keep something and not use it, so that it can be used in the future", "dic_examples": ["She had stored up some nuts to use in the cake."], "clc": "We become energetic and we can store up this energy for those times in which we're bound to a more tight or compulsory timetable. ()"}]}}, "stumble": {"verb    [I]": {"stumble across/on/upon sth/sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to discover something by chance, or to meet someone by chance", "dic_examples": ["I stumbled across these photographs while I was cleaning out my desk."], "clc": "After months of property website surfing and house-hunting over weekends, we finally stumbled upon this amazing end of terrace house in Lavender Road. ()"}]}}, "subject": {"verb": {"subject sb/sth to sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to make someone or something experience something unpleasant", "dic_examples": ["In prison, he was subjected to beatings and interrogations."], "clc": "Homeless [people] are subjected to a very harsh and unhealt[h]y st[y]le of life. ()"}]}}, "sum": {"verb": {"sum up (sth/sb) or sum (sth/sb) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to describe briefly the most important facts or characteristics of something", "dic_examples": ["The oral report should  sum up the main points of the written essay."], "clc": "To sum up, young people are interested in many things but in my opinion, music, TV and clothes are issues about which they care more than others. ()"}]}}, "switch": {"verb    [I]": {"switch off sth or switch sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to turn off a light, television, etc. by using a switch", "dic_examples": ["Remember to switch the computer off."], "clc": "They couldn't call me because my phone was switched off. ()"}], "switch on sth or switch sth on": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to turn on a light, television, etc. by using a switch", "dic_examples": ["Could you switch the light on?"], "clc": "We will switch on a light and will sing \"Happy Birthday\" and the party will begin. ()"}]}}, "take": {"verb                                                                                      [T]": {"take after sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be similar to an older member of your family", "dic_examples": ["Peter's very tall - he takes after his father."], "clc": "They are nice kids and they take after my mother. ()"}], "take sb around (sth/swh)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to walk through a building or visit a place with someone, showing them the most interesting or important parts", "dic_examples": ["A guide took us around the museum."], "clc": "Can you imagine how [pleased] we were with your kind offer to take us around Kyoto. ()"}], "take  away sth or take sth away": [{"gw": "NUMBERS", "gram": "", "is_phrase": false, "level": "B1", "definition": "to remove one number from another number", "dic_examples": ["Four take away two is two.", "If you take 4 away from 12 you get 8."], "clc": "NONE (NONE)"}, {"gw": "REMOVE", "gram": "", "is_phrase": false, "level": "B2", "definition": "to remove something", "dic_examples": ["A waiter came to take our plates away.", "Supermarkets are taking business away from small local stores."], "clc": "The animals were taken away from their own habitat and will spend the rest of their lives in a complete[ly] different situation. ()"}], "take back sth or take sth back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to return something to the place you borrowed or bought it from", "dic_examples": ["Is it too small? Take it back and get a refund.", "I must take my library books back."], "clc": "NONE (NONE)"}], "take down sth or take sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to remove something that is on a wall or something that is temporary", "dic_examples": ["I've taken the pictures down.", "We were taking the tent down."], "clc": "He was taking down a picture of Laura. ()"}], "take  in sth or take sth in": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to understand completely the meaning or importance of something", "dic_examples": ["I had to read the letter twice before I could take it all in.", "It was an interesting exhibition, but there was too much to take in at once."], "clc": "Daddy was dead. They couldn't take it in. ()"}], "be taken in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be deceived by someone", "dic_examples": ["He told her a pack of lies and she was completely taken in by him."], "clc": "He may be surprised, but he'll never be taken in. ()"}], "take off sth or take sth off": [{"gw": "REMOVE", "gram": "", "is_phrase": false, "level": "A2", "definition": "to remove something, especially clothes", "dic_examples": ["He took off his clothes and got into the bathtub."], "clc": "And in the winter I prefer wearing [a] coat [rather] than [a] swe[a]ter, because the co[a]t is easy to put on and easy to take off. ()"}, {"gw": "NOT WORK", "gram": "", "is_phrase": false, "level": "B2", "definition": "to spend time away from your work", "dic_examples": ["He took off two weeks in September."], "clc": "I will try to take some time off so I can come with you, but I don't know if that is possible. ()"}], "take off": [{"gw": "FLY", "gram": "", "is_phrase": false, "level": "A2", "definition": "If an aircraft takes off, it leaves the ground and begins to fly.", "dic_examples": ["The plane took off at 8.30 a.m."], "clc": "The plane took off at 12. ()"}, {"gw": "SUCCEED", "gram": "", "is_phrase": false, "level": "B2", "definition": "to suddenly start to be successful or popular", "dic_examples": ["Her singing career had just begun to take off."], "clc": "The waitresses are quite rude. If you hire new ones, your sales will probably take off. ()"}], "take on sb or take sb on": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to employ someone", "dic_examples": ["She was taken on as a laboratory assistant."], "clc": "To find a job will be no problem, because I work in a coffee shop and I am sure that they will take you on. ()"}], "take on sth or take sth on": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to accept a particular job or responsibility", "dic_examples": ["Make sure you don't take on too much work."], "clc": "So I would take on the job if you changed the conditions. ()"}], "take out sb or take sb out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to go somewhere with someone and pay for them", "dic_examples": ["My dad's taking the whole family out to the theater.", "Our boss took us out for a meal."], "clc": "He was going to take me out to have lunch. ()"}], "take out sth or take sth out": [{"gw": "REMOVE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to remove something from somewhere", "dic_examples": ["He reached into his bag and took out a book.", "I've had a tooth taken out."], "clc": "He took out a knife and when he was about to kill me, I woke up. ()"}, {"gw": "FOOD", "gram": "", "is_phrase": false, "level": "B1", "definition": "to buy food in a restaurant or store and eat it somewhere else", "dic_examples": ["Will that be to eat in or take out?"], "clc": "NONE (NONE)"}, {"gw": "MONEY", "gram": "", "is_phrase": false, "level": "B2", "definition": "to get money from a bank", "dic_examples": ["I took out $50 for the weekend."], "clc": "NONE (NONE)"}], "take over (sth) or take (sth) over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to start doing a job or being responsible for something that another person did or had responsibility for before", "dic_examples": ["He took over from the previous principal in February.", "She took over as manager two weeks ago.", "Colin Lamb has taken over responsibility for this project."], "clc": "The pigs take over all the managerial work, surpervise the other animals and finally alone [make] all the decisions. ()"}], "take over": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become more successful or powerful than something or someone else that is involved in the same type of activity", "dic_examples": ["Italy has taken over from Spain as Europe's favorite vacation destination."], "clc": "TV has taken over as the dominant activity for le[is]ure time, providing something for everyone. ()"}], "take to sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start to like someone or something", "dic_examples": ["For some reason I just didn't take to her."], "clc": "Most children take to her almost immediately. ()"}], "take up sth or take sth up": [{"gw": "FILL", "gram": "", "is_phrase": false, "level": "B2", "definition": "to fill an amount of space or time", "dic_examples": ["This desk takes up too much room.", "The children take up most of my time."], "clc": "It doesn't take up much space. ()"}, {"gw": "START", "gram": "", "is_phrase": false, "level": "B1", "definition": "to start doing a particular activity or job", "dic_examples": ["He's taken up cycling in his spare time", "She's taken up the post of supervisor."], "clc": "I played badminton a couple of years ago and I would very much like to take it up again. ()"}]}}, "talk": {"verb           [I]": {"talk sb into sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to persuade someone to do something", "dic_examples": ["She's managed to talk me into doing a ten-mile run on the weekend."], "clc": "However, it was last summer when I was in Sicily and met Sven, who was a dive teacher, and it was he who talked me into this hobby. ()"}], "talk sb out of sth/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to persuade someone not to do something", "dic_examples": ["It's a ridiculous idea - I've tried to talk him out of it."], "clc": "Hard as he tried, he seemed to be unable [to] talk his partner out of his silly conduct. ()"}], "talk over sth or talk sth over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to discuss something with someone, often to find out their opinion or to get advice before making a decision", "dic_examples": ["I'm going to talk it over with Marty before I do anything about it."], "clc": "She is important to me because I can go to her when I have a problem and we will talk it over until we find a solution. ()"}], "talk sth through or talk through sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to discuss all the details of something, often before making a decision", "dic_examples": ["I'm thinking of taking out a loan, but I need to talk it through with my accountant."], "clc": "She is always there for me both as mother and as friend. Whenever I have a problem, whatever it may be, we sit down and talk it through and she tells [me] her point of view. ()"}]}}, "tear": {"verb        [I or T]": {"tear apart sth or tear sth apart": [{"gw": "DESTROY", "gram": "", "is_phrase": false, "level": "C2", "definition": "to destroy something that was united, such as a country, family or political party", "dic_examples": ["The political situation threatened to tear the country apart."], "clc": "Angola has been torn apart by a 15 year long civil war and is now one of the poorest countries in the world. ()"}, {"gw": "CRITICIZE", "gram": "", "is_phrase": false, "level": "C2", "definition": "to criticize something very strongly", "dic_examples": ["His ideas were torn apart at the meeting."], "clc": "Nevertheless what I am saying was torn apart by an American [piece of] research giving a complete[ly] different version to mine. ()"}], "tear down sth or tear sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to destroy a building or other structure because it is not being used or it is not wanted any more", "dic_examples": ["They're going to tear down the old hospital and build a block of offices there."], "clc": "Their old school had been torn down due to its unpopularity. ()"}], "tear up sth or tear sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to tear paper into a lot of small pieces", "dic_examples": ["He tore the letter up and threw it away."], "clc": "She felt so humiliated and deceived that she tore up all his letters and put his photo in the drawer so that she would not keep thinking of him everytime she looked in that direction. ()"}]}}, "tell": {"verb": {"tell off sb or tell sb off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to speak angrily to someone because they have done something wrong", "dic_examples": ["The teacher told me off for swearing."], "clc": "Then he started shouting at me and telling me off and I felt so bad that I burst into tears in front of [everyone]. ()"}]}}, "think": {"verb": {"think ahead": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to think carefully about what might happen in the future, or to make plans for things you want to do in the future", "dic_examples": ["I'm already thinking ahead to what I might do when my exams are over."], "clc": "On the other hand Muriel has learned that she has to think ahead to protect herself and her son. ()"}], "think back": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to think about things that happened in the past", "dic_examples": ["I thought back to the time when I was living in France."], "clc": "Mary tried to think back to when she had taken it last from the drawer. ()"}], "think over sth or think sth over": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to consider an idea or plan carefully before making a decision", "dic_examples": ["I'll think it over and give you an answer next week."], "clc": "She hadn't been able to think over the situation. ()"}], "think through sth or think sth through": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to  carefully consider the possible results of doing something", "dic_examples": ["He'd put the plan into action without thinking it through."], "clc": "Maybe this is our future if we don't think through the situation [soon]. ()"}]}}, "throw": {"verb            [I or T]": {"throw away/out sth or throw sth away/out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to get rid of something that you do not want any more", "dic_examples": ["So when are you going to throw away those old magazines?"], "clc": "I suggest you throw away your books and come with me to the sea! ()"}], "throw yourself into sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to start doing something with a lot of enthusiasm and energy", "dic_examples": ["She's really thrown herself into her new job."], "clc": "The more you throw yourself into learning English in an English-speaking country, the more interesting and fascinat[ed] you will feel. ()"}], "throw out sb or throw sb out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to force someone to leave", "dic_examples": ["He was thrown out of school for taking drugs."], "clc": "NONE (NONE)"}], "throw up (sth) or throw (sth) up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to vomit", "dic_examples": ["I spent the night throwing up.", "He threw up his breakfast all over the back seat of the car."], "clc": "The next thing I knew was that I was throwing up, in front of everyone, including my mother! ()"}]}}, "tie": {"verb": {"tie up sb/sth or tie sb/sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to tie a part of someone's body with a rope or something similar so that they cannot get away", "dic_examples": ["The two members of staff were tied up during the robbery.", "The horses were tied up outside."], "clc": "It was his mother being tied up in his living room, unable to speak. ()"}]}}, "tip": {"verb": {"tip sb off or tip off sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to warn someone secretly about something so that they can take action or prevent it happening", "dic_examples": ["The robbery was planned for that night, but an anonymous caller tipped the police off."], "clc": "Therefore, I think I should write to you and tip you off in advance. ()"}]}}, "tire": {"verb   [I or T]": {"tire of sth/sb/doing sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to become bored with someone or something, or to stop enjoying an activity", "dic_examples": ["Viewers never tire of nature programs.", "He plays games on his computer for hours on end and doesn't seem to tire of it."], "clc": "\"A man must be strong and persistent in pursuing his aims and goals, he must never tire of it\" - he used to say to me. ()"}]}}, "top": {"verb     [T]": {"top sth off or top off sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to finish something in an enjoyable or successful way", "dic_examples": ["We topped off the day with a fantastic meal at Bruno's."], "clc": "To top everything off, in Europe you now have one currency which means easy payments, wherever you are. ()"}]}}, "track": {"verb    [T]": {"track down sb/sth or track sb/sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to find someone or something after looking for them in a lot of different places", "dic_examples": ["The man was finally tracked down by French police."], "clc": "They managed to track him down at the bottom of the cliff, where he had accidentally fallen, but the cliff was to[o] steep for the climbers to go down. ()"}]}}, "trail": {"verb    [I or T]": {"trail off": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to gradually becomes quieter or  less in amount", "dic_examples": ["His voice trailed off weakly and we could not hear the rest."], "clc": "Fred's voice trailed off as he felt his legs give way beneath him. ()"}]}}, "try": {"verb": {"try on sth or try sth on": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to put on a piece of clothing to discover if it fits you or if you like it", "dic_examples": ["I'd like to try this dress on."], "clc": "I love to shop, to try on new clothes and decide what I'll buy. ()"}], "try out sth or try sth out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to use something to discover if it works or if you like it", "dic_examples": ["Why don't you try out your new racket?", "We're going to try out that Italian restaurant tonight."], "clc": "Moreover we have a riding school for those that want to try out this experience. ()"}]}}, "turn": {"verb": {"turn (sth) back": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to return in the direction you have come from, or to make someone do this", "dic_examples": ["They had to turn back because of the bad weather."], "clc": "As we were walking along we came across a river we couldn't pass, so we turned back. ()"}], "turn down sth or turn sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to reduce the level of sound or heat that something produces", "dic_examples": ["I asked him to turn down the heat."], "clc": "Actually, as I know nothing about instruments, the only thing I could do was just turn the volume up and down. ()"}], "turn down sb/sth or turn sb/sth down": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to refuse an offer or request", "dic_examples": ["He offered her a trip to Australia but she turned it/him down.", "He turned down the job because it involved too much traveling."], "clc": "I hope you don't turn down my invitation. ()"}], "turn (sb/sth) into sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to change and become someone or something different, or to make someone or something do this", "dic_examples": ["The council was hoping to turn a children's home into a residence for adolescent girls.", "The town turned from a small seaside resort into a major\n                             commercial center when oil was discovered."], "clc": "After midnight it turns into a club where you can dance [to] any kind of music. ()"}], "turn off sth or turn sth off": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to move the switch on a machine, light, etc. so that it stops working, or to stop the supply of water, electricity, etc.", "dic_examples": ["Have you turned the computer off?"], "clc": "He turned the TV off and started thinking about Tania. ()"}], "turn on sth or turn sth on": [{"gw": "", "gram": "", "is_phrase": false, "level": "A2", "definition": "to move the switch on a machine, light, etc. so that it starts working, or to start the supply of water, electricity, etc.", "dic_examples": ["Ben turned the TV on."], "clc": "I turned the computer on to check my e-mail box. ()"}], "turn out": [{"gw": "HAPPEN", "gram": "", "is_phrase": false, "level": "B2", "definition": "to happen in a particular way or to have a particular result, especially an unexpected one", "dic_examples": ["The bomb warning turned out to be a false alarm.", "How did the recipe turn out?"], "clc": "It was a very strange situation but turned out to be a good experience because we got know each other because of it. ()"}, {"gw": "BE DISCOVERED", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be known or discovered finally and surprisingly", "dic_examples": ["It turned out that we'd been to the same school."], "clc": "It turned out that Corey was organizing the concert and he asked me and three of my friends if we wanted to help. ()"}, {"gw": "GO", "gram": "", "is_phrase": false, "level": "B2", "definition": "If people turn out for an event, they go there.", "dic_examples": ["Thousands of people turned out to welcome the team home.", "Over 800 people turned out for the protest."], "clc": "On top of that, there were more than 5,000 people who had turn[ed] out [for] the festival! ()"}], "turn to sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to ask a person or organization for help or support", "dic_examples": ["Eventually she turned to her aunt for help.", "Her family lived a long way away, and she had no one to turn\n                             to."], "clc": "People were very friendly and there was always someone to turn to in case of trouble. ()"}], "turn up (somewhere)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to arrive or appear somewhere", "dic_examples": ["Do you think many people will turn up?", "She turned up at my house late one night."], "clc": "A few minutes later two security men turned up. ()"}], "turn up sth or turn sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to increase the level of sound or heat that a machine produces", "dic_examples": ["Could you turn the heat up, please?"], "clc": "But on the other hand they too do never turn their music [up] too much. ()"}]}}, "type": {"verb   [I or T]": {"type in sth or type sth in": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to use the keys on a computer or other device to enter information", "dic_examples": ["How can I type in my password if I can’t remember it?"], "clc": "Unfortun[a]t[e]ly the phone was locked, so you had to type in a password to use the phone. ()"}]}}, "urge": {"verb    [T]": {"urge sb on": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to encourage someone to do or achieve something", "dic_examples": [" The crowd was cheering and urging her on. "], "clc": "Somewhat reluctantly we made to sit down when, full of enthusiasm, he urged us on to follow him further up the mountain. ()"}]}}, "use": {"verb      [T]": {"use up sth or use sth up": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to finish a supply of something", "dic_examples": ["Don't use up all the milk - we need some for breakfast.", "The Earth's resources are being used up at an alarming rate."], "clc": "It saves time which would be used up [by] doing housework such as laundry, cleaning  and ironing. ()"}]}}, "wake": {"verb  [I or T]": {"wake (sb) up or wake up (sb)": [{"gw": "", "gram": "", "is_phrase": false, "level": "A1", "definition": "to stop sleeping or to make someone else stop sleeping", "dic_examples": ["Did you wake up at all during the night?", "I woke up with a headache.", "Come on, wake up - breakfast is ready.", "Can you wake us up at 7, please?"], "clc": "I wake up at 8 o'clock. ()"}]}}, "wash": {"verb": {"wash up": [{"gw": "", "gram": "", "is_phrase": false, "level": "A1", "definition": "to clean yourself, or a part of yourself, with water and usually soap, especially your hands before a meal", "dic_examples": ["Go wash up for dinner now."], "clc": "NONE (NONE)"}]}}, "watch": {"verb": {"watch out": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to be careful", "dic_examples": ["\"Watch out!\" he shouted, but it was too late - she had knocked over the lamp."], "clc": "I definitely know that having a cat brings inconvenience, you have to watch out for your curtains, it can scratch your sofa or your hand, but these are so few problems in comparison [with] all the affection [it] can give you. ()"}]}}, "wear": {"verb        [T]": {"wear off": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a feeling or effect wears off, it gradually disappears.", "dic_examples": ["The injection the dentist gave me is starting to wear off."], "clc": "And Jim, has his pas[s]ion for you finally worn off? ()"}], "wear (sth) out or wear out (sth)": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to use something so much that it is damaged and cannot be used any more, or to become damaged in this way", "dic_examples": ["He's already worn out two pairs of shoes this year."], "clc": "My shoes are worn out too! I have to get new ones. ()"}], "wear sb out or wear out sb": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to make someone extremely tired", "dic_examples": ["Standing up all day is wearing me out.", "They were all worn out by the time the game was over."], "clc": "This does not mean that we have to spend hours in the gym and get home worn out. ()"}]}}, "wipe": {"verb    [T]": {"wipe sth out or wipe out sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to destroy something completely", "dic_examples": ["The earthquake wiped out many villages."], "clc": "We are able to cure diseases that hundreds of years ago would wipe out thousands of people, as, for instance, the Black Plague did. ()"}]}}, "work": {"verb": {"work at sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to try hard to achieve something", "dic_examples": ["You need to work at improving your writing."], "clc": "In my opinion, this is the part our college has to improve and to work at. ()"}], "work on sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to spend time repairing or improving something", "dic_examples": ["Tim loves working on old cars."], "clc": "I believe that it would be best to paint a picture of me in the garage working on my new car. ()"}], "work sth out or work out sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B2", "definition": "to do a calculation to get an answer to a mathematical question", "dic_examples": ["We need to work out the total cost of the project."], "clc": "I had to work out all my figures two times to make sure that my accounts were accurate. ()"}], "work out": [{"gw": "EXERCISE", "gram": "", "is_phrase": false, "level": "B1", "definition": "to exercise in order to improve the strength or appearance of your body", "dic_examples": ["Heidi works out in the gym two or three times a week."], "clc": "At the time I use[d] to work out and I [saw] that he was looking [at] me while I was doing my exercises. ()"}, {"gw": "BECOME BETTER", "gram": "", "is_phrase": false, "level": "B2", "definition": "If a problem or a complicated situation works out, it ends in a successful way.", "dic_examples": ["We were worried that the event would be disorganized, but it all worked out in the end."], "clc": "I hope you follow my instructions and you'll see how everything works out fine. ()"}]}}, "wrap": {"verb    [T]": {"wrap sth up or wrap up sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to fold paper, cloth, etc. around something to cover it", "dic_examples": ["Have you wrapped up Jenny's present?"], "clc": "It was wrapped up in paper with a red ribbon. ()"}]}}, "write": {"phrasal verb": {"write sth down or write down sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "B1", "definition": "to write something on a piece of paper so that you do not forget it", "dic_examples": ["Did you write Jo's phone number down?"], "clc": "I wrote the address down and left the restaurant. ()"}], "write sb/sth off or write off sb/sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C2", "definition": "to decide that someone or something is not useful or important", "dic_examples": ["They had written him off before they even met him."], "clc": "She had written that man off. ()"}], "write sth up or write up sth": [{"gw": "", "gram": "", "is_phrase": false, "level": "C1", "definition": "to write something on paper or on a computer in a complete or final form, often using notes you have made", "dic_examples": ["Have you written up that report yet?"], "clc": "NONE (NONE)"}]}}}